[
    "Australia's favourite classic zucchini slice recipe\nOur most-loved zucchini slice recipe ever While the argument as to what is Australia’s national dish will always rage (is it roast lamb, green chicken curry or a barramundi burger)? One thing is for sure, zucchini slice is hands-down the national food of the home cook. Your lamb, barra and curry may turn up on the menu of a restaurant, but our favourite savoury slice never will. It’s too humble. It just moseys its way into lunch boxes, dinners and even canapes. There’s a reason zucchini slice is taste.com.au’s most popular recipe of all time - it’s simpler than a quiche, tastier than an omelette, and it just works. Why this is our favourite zucchini slice recipe This particular zucchini slice recipe is without doubt the best we’ve tasted (and we’ve tried a lot over the years). Originally submitted by Artarmon Public School in Sydney, it not only has the endorsements of more than 1,000 reviewers, but it’s also been tasted by school kids and the taste team’s tough food critics alike. It manages to pack a big flavour and protein punch with just a handful of ingredients - eggs, zucchini, bacon, cheese and a few other staples - proving it’s totally possible to make a meal that can feed a whole family from pretty much nothing. Key ingredients in zucchini slice: Eggs: zucchini slice is one of those recipes that ticks all the boxes in one go, and thanks to the addition of 5 eggs, you get plenty of protein in this dinner-turned-lunchbox-leftovers slice. Flour: to ensure the zucchini slice isn't too pancake-like, we use a cup of self-raising flour to create a little height and a satisfying, not-too-dense texture. Zucchini: the namesake vegetable star, zucchini (approximately 4 medium-large zucchinis makes up the 375g) shines in this slice. To make sure your mixture isn't too wet, try squeezing some of the moisture out of the grated zucchini (you can use a clean cloth, or just your hands to try to remove some of the liquid. A little moisture is welcome in the batter though, so no need to wring it all out. To save time, we use the grating plate on our food processor to grate the zucchini. Onion: while we generally use a brown onion for this recipe, you can certainly substitute for a red onion to bring extra flavour to the zucchini slice. Bacon: the salty deliciousness and colour of bacon plays an important supporting role in zucchini slice. Our Recipes Editor, Sonya Gellert, has also tested the recipe using plant-based 'bacon' (sometimes called 'facon') and tells us it also works well, if you want to make a vegetarian zucchini slice. Cheddar: grated cheddar cheese makes this slice all the more, well, moreish. For a budget-friendly hack, we buy a block of cheese (which is often more affordable than pre-grated) and grate it ourselves. Vegetable oil: this clever ingredient ensures your slice is one that won't dry out quickly, and will have a deliciously moist texture. 💡 Tip: How to make the best zucchini slice Want to get the best results from this recipe? When we make this zucchini slice (and between us we must've made it hundreds of times) we always ensure we squeeze out the moisture from the zucchini really well to prevent the slice turning out too moist or stodgy. Check out the notes at the bottom of this recipe for more no-fail tips on getting the best results. Want to change up your zucchini slice? Our vegetarian zucchini slice recipe is a great option if you're going meat-free. We've also got plenty of recipe ideas for zucchini slice with a twist to help you experiment with ingredients and flavours. This recipe was originally submitted by Artamon Public School and has now been tried, tested and adapted. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester Make our favourite zucchini slice: full recipe below",
    "Creamy French onion chicken pasta bake\nEverything old is new again, with our re-discovery of the flavour bomb that is French onion soup mix. Although the mix has been around since the 1950’s, it came to recognition when mixed with sour cream to become French onion dip. Since then it’s made its way into other iconic dishes – we’re looking at you apricot chicken and now into this crowd-pleasing pasta bake.  I think of this recipe for creamy French onion chicken bake as one of our “new” classics. Where a few of our favourite recipes have been on our website for years, this is a reasonably new recipe and in a short time has garnered more than 50 favourable reviews, being described as a “new family favourite.” Why we love this French onion bake recipe Let’s face it - it’s a cheesy pasta bake – and we all love that, but our recipe also makes use of pre-prepared ingredients that add so much flavour with very little effort. Not only the packet of French onion soup mix, but we also use supermarket-bought bbq chicken and three cheese mix. We also love that it can be assembled earlier on in the day and cooked just before serving. And, despite being a bake, there’s no turning on the oven, instead a short stint under the grill is all it needs to become bubbly and golden. What you’ll need for our cheesy French onion pasta bake Pasta: We use penne but other short pastas like fusilli, rigatoni or casarecce can be used.  Mushrooms: if your button mushrooms are super small just halve them or keep the whole. You could also use sliced cup mushrooms, but I’d avoid large field mushrooms as they tend to turn the sauce an unpleasant grey colour.  Thyme: Thyme and mushrooms always work well together, but could also use rosemary or a pinch of dry tarragon. Chicken: A supermarket barbecue chicken is loaded with salty spices and a great dinner shortcut ingredients. You could also use chopped pan-fried chicken thigh fillets.  French onion soup mix: If watching your salt intake you can buy a low salt one. Pizza cheese: This handy product combines cheddar, mozzarella and parmesan cheeses that are already grated for you! Parsley: We us continental parsley, but there’s nothing wrong with using curly as we are being a bit retro. Bought barbecue chicken is a great time saver that turns up in many of our favourite recipes, like this chicken and leek pie and quick pesto pasta. It also stars in a warm lentil salad and provides the shortcut for these cheats tostadas, chicken nachos salad and smokey barbecue pizza. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to cook our French onion pasta bake: full recipe below",
    "Easy fried rice recipe\nFried rice has long been a staple of Aussie takeaway dinners. And, while we might all have our favourite restaurant that makes Chinese fried rice just the way we like it, satisfying fried rice is a dish that's surprisingly easy to replicate at home. It's also a great way to use up any freshly cooked rice that's been leftover from the night before. We've been making this particular fried rice recipe for more than 20 years, and it's the version we keep coming back to again and again. Why? It manages to pack in a lot of flavour for surprisingly little effort, and, if you follow our step-by-step tips, you really can create a DIY fried rice dish to rival your local takeaway joint. What makes this our best fried rice recipe? In this super simple egg fried rice recipe we use pantry and fridge staples, but the beauty of basic fried rice recipes is that you can always adjust the ingredients based on what you happen to have on hand at any given time. The real secret here is to use a large fry pan or wok on a very high heat so the rice is fried and golden, rather than steamed or gluggy. Cooking it this way ensures the fried rice still has bite and absorbs the lovely flavours of the bacon and soy, without resembling a risotto! Easy fried rice: key ingredients White, long grain rice. Your fried rice will turn out best if you use cold, long-grain rice (like jasmine rice). It's really important to properly cool the rice down so if you're in a rush and just cooked the rice, spread it thinly on a tray, cover loosely with some cling wrap and pop in the fridge until cool. Soy sauce. We usually use whatever soy sauce is on hand, but of course you can use gluten-free soy sauce (tamari) or low-sodium soy sauce instead and still create a flavourful fried rice. Oil: A good neutral vegetable oil works best for frying, but you can add sesame for added flavour, if you like. Bacon: While we do think the bacon really helps the flavours in this dish, if you don't have it to hand, we have used ham as an alternative. Peas: frozen peas that have been thawed beforehand works best. Carrot: Adds colour and texture. We prefer grated or very finely julienned in this recipe. Eggs: We form an omelette with the eggs to mix through our fried rice, but you could always create a scrambled eggs texture, if you prefer. Shallots: Don't be tempted to skip these. They add colour, flavour and texture. If you've got a fussy eater in your household, you can dial them back a touch, but they really do help round out the flavours of the dish. Additions: Have some sesame oil and oyster sauce on hand? Brilliant! (We've listed vegetable oil here, but sesame oil brings extra flavour to your plate, as does a splash of oyster sauce or fish sauce). A great way to use up leftover veggies and protein, fried rice recipes can be bolstered with plenty of healthy ingredients and can easily be made vegetarian or vegan. You could also jazz things up with kimchi to make a kimchi fried rice. If you'd like to make a low FODMAP version of this fried rice, check out our tips in the Notes section of this recipe. Once you've mastered how to cook this simple egg fried rice recipe, why not explore more variations with our easy fried rice recipes collection? And, if you're after something really lazy, our easy, oven-baked, one-tray fried rice is a great option to try. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make our best easy fried rice: get the full recipe below",
    "Easy butter chicken recipe\nWhat is it about butter chicken (or murgh makhani in Hindi) that makes it loved by children and adults alike? It is like a big hug. A must-order item on an Indian restaurant menu, this home-cooked version has all the same complexity of flavour, yet it’s so simple to make yourself. Tender chicken swims in a tomato sauce flavoured with sweet spices such as cumin, coriander and garam masala, and it’s finished with a generous slug of cream. Why is this our best butter chicken recipe? So what makes our recipe such a delicious curry? In any authentic butter chicken, the chicken is left to marinate in a mixture of yoghurt and spices for hours before cooking. The yoghurt makes the chicken super tender, while the spices penetrate it and give it much more depth of flavour. While the sauce isn’t JUST made from butter, it is made up of a beautiful blend of rich ingredients: the yoghurt from the marinade, stock, tomato and cream. Key ingredients in our butter chicken recipe Yoghurt: Greek-style yoghurt thickens the sauce and adds a creamy lusciousness to the dish (plus a cooling quality and yoghurt tang). Garlic and ginger: this flavourful pairing brings a depth of flavour and a little zing to our butter chicken recipe. Crush the garlic and finely grate the ginger to bring out their flavours. Spices: ground cumin, ground coriander, garam masala and chilli powder come together to create a delicious depth of flavour and bring this well-balanced, mildly spiced sauce to life. Chicken: we use free-range chicken thigh, cut into small pieces to help them cook more evenly (and quickly). Oil and butter: while many traditional Indian recipes use ghee (clarified butter), oil and butter do a good job of recreating the texture of this ingredient. It wouldn't be butter chicken without its namesake ingredient! Onion: thickly sliced brown onion is an instant flavour-booster in this curry. If you don't have a brown onion, you could substitute with a red or white onion. Tomato puree: tomato puree (not to be confused with tomato paste) brings added sweetness, richness and colour to the butter chicken. Chicken stock: stock is a must-add ingredient in this recipe, but if you don't have a chicken stock or chicken-style stock, you can use a vegetable stock instead. In fact, to make this dish vegetarian, all you need to do is use a vegie stock and substitute chicken for paneer or tofu cubes. Cream: thickened cream is what takes this recipe to the next level and gives it the creamy comfort food factor. I recommend serving this version the traditional way with steamed basmati rice and naan bread. If you love chicken curry, you'll enjoy these 15 comforting chicken curry recipes. Or, try our 50 comforting curry recipe ideas. Additional recipe notes by Sonya Gellert, food writer and recipes editor. How to make butter chicken: full recipe below",
    "Impossible quiche recipe\nDon’t let the name deceive you: this ham and cheese quiche recipe is actually incredibly possible to make. Not all quiche recipes are created equal, and this impossible quiche recipe is simple, quick and full of nutritious, everyday ingredients. It may just be the only easy quiche recipe you need in your repertiore. How does an impossible quiche recipe work? What we love about this impossible quiche recipe is that it requires no puff pastry base or pie crust. You simply mix all the ingredients together, pour the egg mixture into the pie dish et voila! A quiche with golden edges forms as if by magic as it bakes. No pie crust required! Making quiche needn't be hard, when you have a classic easy quiche recipe on hand. While quiche Lorraine might be a go-to for many (and we love a quiche Lorraine too), an impossible quiche recipe is even easier and speedier to make at home. And, while we love a good pie crust, a crustless quiche saves time and money. Win, win. Why is this such an easy crustless quiche recipe? For the fact it needs only 10 minutes to prep and a handful of ingredients, this crustless quiche has easily become one of our favourite easy quiche recipe dinners, a brunch menu go-to, and best lunchbox fillers to make. What’s more, you can make this dish ahead and freeze it for up to 2 months. What's not to love about an easy quiche recipe with grated cheddar cheese, onion and diced ham? Yum. Serve hot and golden brown, or cooled as a leftover lunch with salad. Cheddar cheese makes a great tasty addition to this crustless quiche recipe, which has received 5 stars from more than 270 home cooks. Minimal prep, 5 stars, on the table in under an hour? That's what midweek dinner dreams are made of. And, if you like a little extra kick, you can drizzle with hot sauce, sprinkle in green onions or add fresh herbs, Swiss cheese or goat cheese. It really is a great recipe, and incredibly versatile. Bake until golden brown and you have yourself a delicious meal at any time of day. Key impossible pie ingredients Ham: levelling-up the flavour of this very possible pie is chopped ham. If you prefer, you can certainly swap out ham for bacon or pancetta, or even plant-based 'bacon'. Onion: subtle but mighty, onion turns this humble pie into a magic midweek meal that's flavourful and delicious. Tasty cheese: the secret star ingredient in this recipe is tasty cheese, which brings its sharp bite to the quiche (that kids and adults will both love at any meal). Eggs: the magic ingredient that makes this pie possible, protein-rich eggs bring our ingredients together and create a lovely light texture when combined with milk. Flour: finally, a little flour makes our quiche more solid and structurally sound, and ties it all together. It's self-raising flour, which helps our quiche rise and hold its shape. For more quiche inspiration, check out our collection of best-ever quiche recipes, our best quiche Lorraine recipe, and our sweet take on the impossible quiche with this butterscotch version. This was originally a recipe sent in by a taste magazine reader that has now been tried, tested and adapted. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester",
    "Slow cooker braised steak and onions\nAlthough – like most Australians - I grew up eating many British foods, braised steak with onion wasn’t one of them. So when I was asked to develop a recipe for a slow cooker version, I viewed it as a blank slate. After a bit of research, I realised what a simple affair it was. Basically just steak, onion, stock and Worcestershire sauce. So, I set out to see how I could make this simple comfort dish even easier. Where some recipes dice the beef, I took the word “steak” as literal and cut the beef into thick slices (easier than doing all that chopping). In most original versions, the beef is coated in flour before browning off. I skipped this step, instead thickening the mixture with cornflour at the end. I also decided to slice the garlic rather than finely chopped as when slow cooked garlic loses its intensity, but keeping it in large pieces the flavour kept on giving. I also decided to cook the onions in butter to bring out their sweetness. Why we love this braised beef with onions recipe Our braised beef with onions recipe ticks many boxes: it’s budget and comforting and has minimal prep for maximum flavour. It’s also gluten, egg and dairy free. From the reviews it seems like this recipe is a hit with the kids. This may be because of the lack of veggies, but If you wanted you could slow cook the beef and onions with thick slices of carrots and stir through some peas at the end. What ingredients do I need to make braised steak and onion: Beef: I opted for topside as it’s a cut used in a traditional beef pot roast. I wanted to use a whole piece so I could slice it thickly enough to appear to be a steak, but still become super tender. You could use pieces of chuck steak if you preferred, the flavours will be the same. Onion: I always use brown onions when caramelising. Although some cooks insist on red onions, I find the brown has the right sugar content to allow the onions to get brown and softened just to my liking. Cornflour: Not only does this thicken the sauce, it also gives the whole dish a glossy sheen. Tomato paste: I added this for the extra flavour and also to give the sauce a slightly russet look. Always make sure you cook tomato  paste off for a minute before adding the remaining ingredients as this takes away the slight metallic taste. Worcestershire: Containing the sweet and sour contrast of molasses and tamarind, Worcestershire sauce in a umami flavour bomb. Only a small amount is required to give an amazing depth of flavour. Stock: I always use chicken stock in my recipes whether it be beef or lamb because I believe that it has a superior taste, providing a boost of salt and herbs. Herbs: While the thyme and bay leaves add flavour, the fresh parsley at the end freshens and lifts the dish.  This classic beef and onion recipe just cries out to be served with potatoes, whether a classic mash or a more involved colcannon. You could also serve this braised beef and onion with a cheesy potato bake and it also goes beautifully with cauliflower cheese. You could also spoon the completed dish into a casserole dish and top with these herbed and cheesy dumplings.  Additional recipe notes from Alison Adams, Food Writer and Recipe Tester How to make braised beef: full recipe below",
    "Curried sausages recipe\nRetro is back, baby! At last, I can make my shameful curried sausage love public. Why we love this curried sausages recipe As a meal, curried sausages has enough kick to know you’re alive, but it’s not too spicy for kids, making it an ideal midweek dinner for families – and it’s pretty easy on the budget too! Whether it's served with creamy mash or fluffy white rice, it's bound to please everyone at the table. Key ingredients that bring flavour to curried sausages Fruit chutney: the natural sweetness of carrots coupled with the fruity chutney is a perfect match for the piquant curry powder and hearty sausages. (You can use any fruity chutney you like or have open in the fridge). Curry powder: bringing warmth (but not too much heat) to this recipe, curry powder is what gives this dish its distinct flavour (and name!). Beef sausages: you can use any unflavoured sausage you like, but beef sausages are a delicious match for the curry sauce. Chicken stock: a staple ingredient in so many classic dinners, chicken stock brings its brothy flavour to this gravy-like sauce. You can use beef or vegie stock if you don't have chicken stock. Onion: sausage and onion goes together like bread an butter (and also go really well in bread and butter). The sweet-savoury richness of a brown onion brings added depth to curried sausages, but you can use a red onion if that's what you have at home. Curried sausages can be served with rice (as a nod to curry) or mashed potato (hello bangers)! My guilty pleasure, however, is serving it with the sausage already cut up, in a bowl, with thick slices of buttered bread, on the couch! Additional recipe notes by Alison Adams - Food Writer and Recipe Tester. How to make the best curried sausages: full recipe below",
    "Our favourite lasagne recipe\nFall in love at first bite with our favourite lasagne recipe. With layer upon layer of ground beef mince meat sauce, pasta, and creamy cheesy sauce, this comforting lasagne (or lasagna, for those in the US) is a warm hug on a plate. Originally developed by Sarah Hobbs and re-tested by Alison Adams, this delicious recipe has been absolutely perfected. What's our secret to our best lasagne recipe? There are many good reasons this particular lasagne recipe has become so beloved. The addition of wine in the meat sauce makes it super flavourful, while the layering of pasta (or 'lasagna noodles' for those in the US!) with mozzarella makes for the perfect 'cheese pull moment' (watch our video to witness it in action). But if we were to pick one thing that makes this lasagne recipe stand out above all others, it’s the luscious bechamel. A good homemade bechamel base or 'cheese sauce' takes time, but it’s worth it for the extra depth of flavour it brings. The best thing about a rich Italian ragu lasagne is that it tastes even better the next day, even when heated in the microwave. This recipe is also freezer-friendly and will keep for up to 3 months in an airtight container. You can wrap individual portions in freezer wrap, ready to take out for a quick and easy dinner-for-one or to create some lunch envy in the workplace. This amazing lasagne recipe, with its rich tomato sauce, is an absolute favourite among the taste.com.au team (hence the name!), but don’t just take my word for it: our members are raving about it too. One reviewer even said she made it for her husband “who grew up eating lasagna his Italian mother cooked him” (no pressure!) and “he thoroughly enjoyed” it.  Fewf (wipes brow). With a 4.5-star rating and multiple rave reviews, it’s safe to say this recipe is now an adopted Aussie classic. Key ingredients in our favourite lasagne Beef mince: it would hardly be a classic family favourite lasagne without a rich, ground beef mince sauce. Beef mince is ideal for bulking up a lasagne and adding protein to the dish. Our Recipes Editor Sonya Gellert has also made this recipe using plant-based mince, and declared it a delicious success. Italian diced tomatoes: a double duty ingredient, Italian diced tomatoes bring both moisture and added flavour to your meat sauce. We love how this simple pantry staple does so much heavy lifting in this recipe. Tomato paste: while we use lots of simple ingredients to bring flavour to this recipe (think onion, garlic, a splash of dry red wine and seasonings), for us tomato paste is a non-negotiable. It's an instant umami-bomb and a little goes a long way. Fresh lasagne sheets: we think fresh is best when it comes to lasagne sheets, but if you only have dried lasagne sheets, you can pre-cook your pasta sheets to soften them (following packet directions) before cooking. This will ensure your pasta isn't raw and crunchy. In our recipe notes, we have suggestions for other layers you can use instead of pasta too. Mozzarella: what would a baked lasagne be without the golden brown top and cheesy pull? We use a dry mozzarella (and coarsely grate a block), rather than fresh, wetter mozzarella, to ensure that magic pull moment and a signature, alluring topping. Feeding a crowd? check out the vegetarian lasagne recipe that even meat lovers will swoon over, and our collection of more delicious lasagne recipes. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make our best-ever lasagne: get the full recipe below",
    "Air fryer chicken rissoles\nCrisp on the outside and tender and juicy within, rissoles made in the air fryer are not only lower in fat, they’re absolutely delicious. With (largely) hidden zucchini these chicken-y cheesy flavour bombs are soon to become a family favourite, especially in the warmer months when turning on the stove, even for simple pan-frying seems like too much of an effort.   I’ll be the first to admit I was cynical about air fryers. After seeing so many gadgets come and go (I’ll sell my churros maker to the lowest bidder), what was all the hype? And then I started playing around with it. Not only do they halve cooking times, making them so much more energy efficient than turning on the oven, but I love that they’re a safe way to get kids cooking and reheating their food.  Why we love this rissoles recipe These air fryer chicken rissoles are just so versatile. Serve as we suggest with salad and a honey mustard dressing during summer or with mash and gravy in winter or you could also pop them in burger buns along with some air-fried bacon and aioli and serve with sweet potato chips.  What do you need for air fryer chicken patties? Chicken mince: chicken mince is a low fat, budget-friendly ingredient. Because of its neutral flavour it’s perfect for children’s meals. Check out these family friendly chicken mince recipes here.  Panko: panko breadcrumbs are made from Japanese bread that has been flaked and dried, resulting in large “crumbs”. Not only are they ideal for coating and then frying food, they also make an excellent binder, soaking up the excess liquid to allow the chicken rissoles to become crisp. Parmesan: finely grated parmesan adds a nice salty kick as well as being another binder to hold the air fryer rissoles together.   Green shallots: rather than having to fry off onion to flavour your chicken rissoles, thinly sliced green shallots  add that same oniony hit, but in a milder way.   Zucchini: it’s the grated zucchini that makes these rissoles so tender, as well as adding fibre and antioxidants to this healthy meal. Honey mustard dressing: we make our own quick dressing, but you use a bought one or swap for some caramelised onions or tomato relish. Air fryers certainly make light work of dinners. In fact, you can create a whole balanced dinner in one like our saltimbocca with asparagus or herb-crusted salmon with crisp potatoes. How about cooking up this quiche Lorraine and serving with a green salad or serve this air fryer tofu with sizzling garlic Sikmply heat some microwave rice to keep with the quick and easy theme. The air fryer makes light work of a chicken cordon bleu or serve up our sticky pork belly with sweet potato chips.  Additional recipe notes from Alison Adams, Food Writer and Recipe Tester How to make chicken rissoles: full recipe below",
    "Delicious Thai beef salad recipe\nThai cuisine is one of contrasts and Thai beef salad is a perfect example. In the dressing alone, sweet meets salty, spicy and sour and in the salad intense chilli meets gentle aromatic herbs and cooling cucumber, all coming together in perfect harmony. Why do we love this Thai beef salad recipe? A much loved and ordered restaurant item, this Thai beef salad recipe brings this heavenly dish into your own home. The secret? While most Thai beef salad recipes just season and grill the meat, this recipe uses the ingenious trick of marinating it in half of the dressing. This not only flavours and tenderises the meat, but the palm sugar in the dressing helps caramelise the surface. Known as yum nua, this Thai beef salad is easy enough to be cooked as a weeknight dinner, but also special enough to be served as part of a Thai banquet. If you're planning a Thai feast that's better than take-away, here are our favourite homemade Thai food recipes to try and 15 Thai desserts you'll want to devour with haste!",
    "Creamy coconut beef and pumpkin curry\nLet the crockpot do all the work with this slow-cooker Indian beef and pumpkin curry. Serve with rice for a super-easy dinner.",
    "Easy chicken stir fry recipe\nThere’s nothing we love more than a speedy, easy and healthy dinner, which is why we’re always in the mood for a chicken stir fry. Whether you’re short on time, looking to empty out the vegetables in your fridge, or you just want to eat cleaner, a chicken stir fry is a great all-in-one staple meal that even the kids will love. What makes this such a great easy chicken stir-fry recipe? The best part about a chicken stir fry s is that anyone can make them, regardless of cooking abilities. But this chicken stir fry recipe is one we find ourselves coming back to again and again when we crave a healthy, easy meal during the mid-week dinner rush. Ready in 30 minutes, our easy chicken stir fry uses a range of colourful vegies, tender chicken breast, and a salty, sweet Asian-inspired sauce. Not to mention, this chicken stir fry has an 8.4 health star rating, making it great for those following a lower-calorie diet. What goes into a great chicken stir fry: key ingredients Peanut oil: peanut oil forms a great flavour base for a chicken stir fry. Chicken breast fillets: we use three chicken breast fillets in this easy stir fry recipe, and cut them into strips. But if you'd prefer to buy pre-cut strips, that's absolutely fine too. Vegetables and aromatics: this delicious chicken stir fry includes a plentiful serving of feel-good vegetables and aromatics, including brown onion, capsicum, mushrooms, broccolini, fresh ginger, garlic and chillies. Soy sauce: all good stir fry recipes include a splash of the salty deliciousness that is soy sauce, and this chicken stir fry is no exception. We've use a salt-reduced version here. Oyster sauce: another great flavourful addition to our chicken stir fry is the umami-rich oyster sauce, which brings added depth. Bean sprouts and coriander leaves: for crunch and added greenery, we top this chicken stir fry with beans and coriander leaves (but of course you can omit the coriander if you're not partial to it!). White rice: ideal for soaking up that delicious sauce, medium-grain white rice makes a meal of it. For more speedy and healthy dinner inspo, try these vegie-filled vegetarian stir-fries, these easy chicken dinners and our top 100 healthy recipes of all time. And, see some delicious stir-fry recipe ideas for varying your dinners, in our recipe notes below. Additional recipe notes from Alison Adams - Recipes Editor and Food Writer",
    "Creamy garlic prawns recipe (with video)\nYou had us at ‘garlic prawns,’ then we read ‘creamy’ (swoon) and, finally, we learnt this recipe takes only 10 minutes to prep and 10 minutes to cook, and we were head over heels. We love learning from our readers and this recipe from Taste reader ‘KRISSSY86’ has become a favourite of ours. Why is this our go-to creamy garlic prawns recipe? When it comes to enticing kitchen aromas, garlic sizzling in a pool of butter is top tier, and these two ingredients form the base of this restaurant-quality, creamy garlic prawns recipe. Then, we elevate matters with a splash of floral white wine and a generous pour of cream. No hard-to-find ingredients are required here – just a handful of chopped, fresh parsley to give the dish a final boost. The ease of this creamy garlic prawns recipe makes it suitable for a midweek meal, served simply with steamed rice. And yet, its elegance steers it into dinner party territory, perhaps tossed with angel hair pasta to create an indulgent entrée. We know how much our home cooks adore our prawn starter recipes. And, just a couple of extra ingredients transforms this culinary concept into a creamy Tuscan garlic prawn recipe. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester.",
    "San choy bau\nSan choy bau is a dish embraced by all ages. Sweet, sour and salty flavours meet tender, crispy and crunchy textures all wrapped up like a present! Our san choy bau recipe brings this Chinese restaurant classic into your own home. Umami-rich oyster and soy sauces flavour soft and juicy pork mince and contrast against the tender-crisp pop of bean sprouts and crunch of peanuts. And who doesn’t love having to eat with your fingers! - Alison Adams - Food Writer and Recipe Tester",
    "Chilli con carne recipe\nWholesome chilli con carne recipe With lean beef mince, red beans and a nice kick of heat, our hearty chilli con carne recipe is a family favourite. Serve with steamed white rice or as a filling for enchiladas or burritos. I’ve been eating what we in Australia know as chilli con carne since childhood. Why not? It’s simple to prepare, low budget and loved by kids and adults alike. It wasn’t until I started researching the history of this beloved chilli recipe that I realised what a controversial dish it is to Americans. I won’t say that vendettas and feuds have been started over what should and shouldn’t go into a bowl of traditional chilli con carne (or chili, for those in the US) but there’s a lot of passionate opinion around the subject. Opening a can of beans: should chilli con carne contain beans? Known as the state dish of Texas, locals are adamant that a proper con carne should contain no tomato and no beans! Instead chunks of beef are simmered in ground smoked chilli with stock. Here in Australia, we’re a bit more relaxed, to us it’s just beef, tomatoes and beans with a hit of chilli in our chilli con carne recipe. Our favourite chilli con carne recipe adds a couple of capsicums for good measure. This versatile chili con carne recipe serves eight, so freeze half for later, ready to be served on baked potatoes, corn chips or rice and topped with pickled jalapenos, shredded cheese and sour cream or rolled in burritos or baked into enchiladas. What is chilli con carne made of? Aussie chilli con carne is made on ground beef mince. We’ve gone with 5-star lean mince, which has helped give our chilli recipe a 8.8 health rating. Rather than using a combination of spices, we’ve used Mexican chilli powder, which is a mix of paprika, chilli, cumin and oregano. Adding the fresh chilli is up to you – add more or omit, it all depends on your heat tolerance. Some like to add extra ground coriander and a topping of fresh coriander too. Capsicum and chilli are from the same family so we’ve added a couple for extra fibre and colour. A traditional Texan chilli uses smoky dried chillies, but we’ve cheated by using smoked bacon. Chilli con carne (or 'chili con carne' in the US) was an early invention in what later became known as Tex Mex cuisine, where Mexican flavours were added to dishes that were actually developed in Texas. This includes original Texan nachos that were simply cheese and jalapenos on corn chips, as well as breakfast tacos, fajitas, queso and refried beans. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester.",
    "One-pan teriyaki beef and rice\nThis easy beef mince dinner is ready in just 20 minutes and only uses a few ingredients- so it won't break the bank!",
    "Spaghetti Carbonara Recipe: Our favourite pasta in under 30 minutes\nWe throw tradition to the wind with our speedy spaghetti carbonara recipe, with some sneaky shortcuts for time-poor cooks. It may taste exactly like the real deal, but this carbonara sauce has some secrets behind its glossy surface, proving some rules are just begging to be broken. What's the secret behind this easy spaghetti carbonara recipe? Beloved my many, our easy carbonara recipe is one of Australia’s most popular recipes, and we know exactly why it's become the stuff of weeknight legend. We do the thing your nonna told you not to: we add cream. And yet, although it breaks from the traditional Italian recipe, it’s all for a delicious reason. We promise. Traditional carbonara recipes require a degree of technique (for example, adding ingredients at just the right temperature and time) and quality (read: expensive) ingredients, which just aren’t ideal for regular weeknights. That’s why we like to add thickened cream to our carbonara recipe with cream. A cheaper supermarket ingredient that ensures a velvety, indulgent sauce that will rival a restaurant-made spaghetti carbonara, a splash of cream means dinner's ready in 12 minutes! This carbonara recipe is one of the quickest you’ll come across. Here's to making weeknights simpler (without compromising on flavour). Go on, break the rules. We won't tell. Key flavourful ingredients in our spaghetti carbonara Pancetta: providing the perfect salty hit for your carbonara dish, pancetta acts as a shortcut to umami deliciousness. If you don't have pancetta, you can certainly use bacon. For a vegetarian version, you can sprinkle your pasta with 'bacon bits' instead, which are generally made from soy-based ingredients (just check the packet!) or use some rinsed capers for a salty addition. Eggs: Not silky carbonara sauce would be complete without eggs, which also bring added protein to your dish. Though this may not be a traditional carbonara, the eggs still play an important role. Thickened cream: our shortcut to getting this meal on the table in next-to-no-time, thickened cream bolsters the sauce and creates a luscious, rich sauce. Parmesan: sharp, tasty parmesan cheese brings extra cheesy goodness to the table. We suggest adding some to the creamy carbonara sauce, and reserving extra to sprinkle on your bowl of pasta at the end (alongside parsley, if you're using it). Vegetarians can also look for vegetarian-friendly parmesan in supermarkets. Here's some other old-school favourites we've made simpler. More time to spare? Try our slow-cooker carbonara recipe, too! Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make our easy spaghetti carbonara: get the full recipe below",
    "Curtis Stone's stir-fried rice noodles with chicken and vegetables\nCurtis Stone hit the nail on the head when he developed this quick and easy stir-fry featuring slippery rice noodles, tender chicken and vegetables all coated in a umami-rich sauce. Perfect for a weeknight dinner, this dinner ticks all the boxes for speed, nutrition and taste. This recipe is on high rotation at my place as it is so versatile. Noodles are always a favourite with kids and this recipe is a fun way of getting their vegetable intake up. On its own you’ll only get a very mild heat, but feel free to serve with sliced fresh chillies or chilli crunch on the side to spice things up a bit.  Why we love this one-wok wonder Using chicken mince and cheap-as-chips rice noodles, this stir-fry is really friendly on the budget - even more so if you just use whatever you have lying around in the crisper drawer and perhaps a bit of leftover roast meat. Super easy, this recipe requires little chopping (often the bane of a tired cook). You can even buy shredded carrots and sliced mushrooms to make life even easier and using the ready chopped garlic and chilli sauce gives a deep flavourful hit. You can easily play around with this noodle stir-fry to adapt to different dietary requirements. Omit the meat and use tofu for a vegetarian option (you can stir through a whisked egg at the end of cooking for extra protein). This dish can also be made gluten free (read more below). What you’ll need to make this family friendly stir-fry recipe Oyster Sauce: made from dried oysters, soy sauce and sugar, oyster sauce packs a mighty punch, adding an amazing umami element to stir-fries, marinades and glazes. Soy sauce: make sure you use light soy sauce as dark is used more for colour and is a bit overwhelming. Chilli garlic sauce: although optional, I recommend you always have a jar of the chilli garlic sauce in the fridge. Medium in heat, it works as both condiment as well as added to stir-fries. Pad Thai noodles: these versatile noodles can be served cold in a salad or warm as in this stir-fry recipe. Chicken mince: so much easier to cook than strips which can tend to overcook. You can swap for pork mince if preferred.  Mushrooms: we just use cup mushrooms, but buttons or a mixture of shiitake, enoki and oyster can be used. Avoid large field mushrooms as they tend to make the stir fry look a bit grey. Instead they are best stuffed or used as an alternative to meat in a burger, or simple top with a dab of garlic butter and cooked in the air fryer.   Carrot: we say to cut the carrot into matchsticks, but I opt for the easier option of coarsely grating them (sshhhh).  Onions: we use sliced brown onion in our chicken stir-fry as a flavour base and then thinly sliced green onion for a fresh oniony hit at the end. Introduction and recipe notes by Alison Adams.",
    "Our best ever spaghetti bolognese recipe\nSpaghetti bolognese, or spag bol, as it's affectionately known in Australia, is what most of us would consider to be the quintessential Italian meal. However, In Italy, the thick, slow-cooked Bolognese sauce is usually served with flat pasta or in a lasagne. This spaghetti bolognese recipe really is a great recipe. It's absolutely delicious, and here's why we love it so. Why is this our favourite spaghetti bolognese recipe? Our version starts with a soffritto mix of finely chopped onion, celery and carrot (plus garlic) and is flavoured further by diced tomatoes, oregano and nutmeg. This particular spaghetti bolognese recipe is diabetes-friendly, making it suitable for everyone's dinner. It's easy to make spaghetti bolognese at home on any night of the week, and you can freeze the ground beef meat mixture for future use. You'll thank yourself later! Our best spaghetti bolognese recipe (and yes, that's a big call) is one kids will love, adults will crave and ticks the nutritional boxes! If this classic spaghetti bolognese is a favourite in your home, you're bound to adore our easy spaghetti bolognese bake, this 5-ingredient bolognese rice bake (a total midweek saviour!), our cheesy spaghetti bolognese pie, our garlic bread spaghetti carbonara, and this collection of budget-friendly pasta recipes.",
    "Slow cooker honey mustard chicken\nMake sure you have some crusty bread on hand to mop up the sauce on this easy peasy chicken dinner.",
    "Beef nachos recipe\nOur favourite nachos recipe Nachos are one of the best comfort foods out there - the crunch of the corn chips, scooping up fragrant and flavourful ground beef and salsa, and who could forget about delicious, stringy pulls of cheese! It’s so tempting to just order from one of the many Mexican chains out there, but the cost per serve and delivery fees motivate me to make my own. Lucky for you, with this easy beef nacho recipe, you’ll be able to use a bunch of on-hand ingredients to make it and there’s only three steps before you can enjoy a big bowl for dinner! How do you serve nachos? Finish off your beef nachos with salsa, avocado, sour cream and coriander for the ultimate dinner winner. Of course, you can add heat with some jalapeños too. Put the tray of nachos on a heatproof board or trivet on your table and watch eyes light up at the ultimate share dish arriving. Key ingredients in beef nachos Beef mince: ground beef mince is not only a budget-friendly way to put a hearty meal on the table, but it takes on all the flavours and spices in this recipe to create a crave-worthy nachos topping. You can of course use other types of mince, if you prefer, and even a plant-based mince if you wish to make vegetarian nachos. Beans: we use kidney beans to bulk up this nachos dish, but you can also use black beans if that's what's in the pantry. Chilli powder and taco seasoning: this hard-working duo brings our ground beef mince mixture to life but, if you're not into spice, you can omit the chilli powder. Need more chilli? Adjust to your tastes! Tomato paste: for a savoury flavour bomb, tomato paste is the answer. If you don't have tomato paste, you can add a splash of passata (but it won't have quite the same concentrated strength of flavour). Toppings: we love the combination of grated cheese, sour cream, salsa and fresh coriander, but you can play around with toppings (and add hot sauce, if you wish), based on your preferences. Corn chips: nachos wouldn't be complete without their bed of corn chips, but if you have any leftover meat sauce mixture, you can add it to taco shells, tortillas, or even pile it on toast. Taste.com.au is home to many enticing nacho recipes. Try our tray-bake nachos, easy tuna nachos, these loaded nacho fries for a fun twist, or our outrageous cheeseburger nachos. There are plenty of veggie versions too if ground beef isn't your style. Just don't forget the guac! Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make our beef nachos: full recipe below",
    "French-style chicken and potatoes\nTake your tastebuds on a trip to France with this delicious and easy French-style creamy chicken and potato bake.",
    "Delicious minestrone soup recipe\nMost of the classic Italian dishes are steeped in frugality. Known as cucina povera – meaning ‘peasant food’ or ‘poor kitchen’ - with this style of cooking nothing is wasted. Stale bread turns up in a panzanella, leftover cooked pasta is used in a frittata, and those jars or cans of tuna, capers and anchovies can be used to make a classic puttanesca sauce. This classic minestrone soup recipe is one for the ages. It's comforting, warming, full of healthy ingredients and is hearty enough to feed a crowd.  What is minestrone? Minestrone soup is another fine example of this practical form of cooking. Laying somewhere between a soup and a stew, minestrone is more of a guide than a recipe. Always nourishing and simple to prepare, it opens itself to using whatever you have in the pantry or crisper drawer (see more about this below). Whatever you use, minestrone is a hearty, homey, bowl of goodness that costs next to nothing and is all cooked in the one pot.   Why we love this minestrone soup recipe Our minestrone is also low in fat and high in fibre, making it nutritious as well as highly delicious and is ideal for dinners or a weekend lunch served with some crusty bread. Key ingredients in our minestrone recipe: Bacon: bacon rashers add a salty, umami kick to minestrone, which can of course be omitted if you wish to make a meat-free soup. Carrots, celery and potato: these common crisper leftovers make a flavourful and health-giving addition to minestrone.  Garlic: it would hardly be a hearty Italian soup recipe without the addition of garlic! Stock: we use beef stock for a rich depth of flavour, but you can use a vegetable stock if you prefer. Canned chopped tomatoes: finely chopped canned tomatoes bring a sweet richness to the soup-meets-stew.  Kidney beans: we love how many budget-friendly canned ingredients can bolster this recipe. We use kidney beans but you could use cannellini beans, if you prefer.  Pasta: we use a small shell pasta to bulk up this recipe, but any small pasta shapes you have in the pantry will work well here. Parsley: we use continental parsley, but this soup is great for using up fresh herbs, so feel free to get creative with what you have on hand. Love a bulked-up, budget-friendly minestrone soup recipe? Try this vegetarian minestrone soup, our meatball minestrone soup recipe, this spring-inspired green minestrone with whipped lemon fetta and this cheesy, garlic-bread-topped version. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make minestrone: full recipe below",
    "Classic shepherd's pie recipe\nA classic British and Irish dish that’s loved the world over, shepherd’s pie is the ultimate comfort food. What's in a shepherd's pie? Made with lamb mince, a rich gravy and buttery, creamy mashed potatoes, this recipe has all the elements for a perfect slow Sunday dinner and is on the table in just over an hour. Key ingredients in our classic shepherd's pie: Vegies: you certainly get your fill of vegetables with this shepherd's pie recipe, with frozen peas, carrot and celery (and an onion) dappled throughout. You can, of course, substitute for any vegies taking up space in your crisper, but we find these work best. Lamb mince: a flavourful ground lamb mince meat mixture makes this pie one you'll want to make a double batch of. It's rich, savoury and includes some clever flavour-boosting additions (see the next key ingredients) plus stock. Worcestershire sauce: we love the addition of Worcestershire sauce as it brings a deep umami flavour and a sweet, tangy and spicy punch all at once. Bay leaf: the unassuming bay leaf is a small but mighty ingredient that further bolsters the flavour of the meat mixture. Tomato paste: when it comes to tomato paste, a little goes a long way to bring a sweet, umami-rich flavour and round-out the mince mixture. Potato: the star of the show, the buttery, golden-brown potato topping on this shepherd's pie sees desiree potatoes combined with butter and milk for a creamy, crispy-topped finish. You can use any milk you like, but we use full cream. And, we find desiree potatoes are the best-in-show when it comes to creamy mash. The whole family is destined to be delighted by this classic and, dare we say, best shepherds pie recipe with its potato topping. This golden brown mash-topped dish is nearly impossible to resist. And, if you love a warming comfort dish, you'll love our variations on this classic recipe, too. Try our beef shepherd's pie, a vegetarian shepherd's pie (that's actually vegan too), our much-loved easy shepherd's pie, and these individual pies. How to make classic shepherd's pie: full recipe below",
    "Beef stroganoff recipe\nI think of beef stroganoff as having the warm comforting taste of a slow-cooked stew with the cooking style of a stir-fry. In this beef stroganoff recipe, thinly sliced beef is sauteed until just sealed, but still rare (and never chewy!) Out of the pan it goes then in goes the onion and mushrooms, cooked until just tender. Why is this the best beef stroganoff recipe? In this version, the beef stroganoff sauce flavours are built up with some clever key ingredients. Although many stroganoff recipes use sour cream, we use creme fraiche for richness (see below for more details). Paprika is also the star of this recipe. Its mellow capisum flavour adds a touch of sweetness. The result? Beefy, creamy deliciousness in only 25 minutes.   Key beef stroganoff ingredients Tomato paste: tomato paste is one of those hard-working ingredients where a little goes a long way to adding a salty-sweet umami richness to a dish, and beef stroganoff is all the better for a couple of tablespoons of the good stuff. Mustard: another cook's essential, mustard adds additional depth of flavour to our stroganoff sauce. Crème fraîche: velvety, creamy and tangy, crème fraîche works wonderfully in this beef stroganoff recipe (but you can use sour cream, if you prefer). Paprika: harking back to the original recipe, paprika brings its sweet-savoury vibrancy to this recipe. What do you serve with beef stroganoff? Beef stroganoff was originally served with roast potatoes or mashed potatoes, but you can also serve beef stroganoff with buttery pasta or egg noodles, ready to soak up the gorgeous creamy sauce. Is time on your side? Why not try our slow cooker beef stroganoff so you can set and forget and it’ll be ready in time for dinner (our slow cooker beef stroganoff is one of our most popular beef stroganoff recipes). There are also plenty more beef stroganoff recipes to choose from, including healthy versions, our enticing stroganoff rissoles and even a beef strog cob loaf! Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make beef stroganoff: full recipe below",
    "One-pot Italian chicken\nI grew up on creamy dishes, with them being served probably twice a week. Whether it be stroganoff or a chicken casserole, they nestled in nicely with the spaghetti bolognaise and a roast. It seems that many of you, like me, continue this tradition, with comfort dishes — especially bakes — being very popular, so I’m sure you’ll love this one.  When I was asked to write a recipe for a one-pot Italian, my mind immediately went to Northern Italy, known for its cream, cheese and butter. I’d also long been thinking about how sun-dried tomatoes had dropped out a bit in cooking of late, so they had to go in as well as the royalty of Italian herbs, basil.    What I didn’t realise is that I’d developed a recipe uncannily similar to the future “marry me chicken”. I swear I did this one first! Why we love this creamy one-pot Italian chicken recipe This family-friendly one-pot chicken recipe is an all year rounder. Rich and creamy it hits the spot in the cooler months and with the summery tastes of tomatoes and basil it is sunny enough for the warmer times, especially if served with a crisp green salad.   Ready in under half an hour, our creamy chicken recipe is bang on for both ease and taste. It’s also versatile. Slice the chicken and toss with just-cooked pasta and a smattering of parmesan cheese for the perfect midweek dinner. For a change, you could also swap the chicken out and use pan-fried thick pork chops instead. What do you need to make this one pot Italian chicken? Oil and butter: oil provides the medium for cooking the chicken with butter adding a good hit of flavour. Because we’re adding the butter, standard olive oil is fine. It doesn’t have to be a fruity extra virgin one. Chicken: chicken breasts are a great canvas for cooking. Take the suggestions from a few of our readers and slice them in half horizontally for even quicker cooking.  Sun-dried tomatoes: a means of preserving summer’s tomato bounty, they have an intensely tomato taste. They are quite chewy as well which is why we slice them.  Wine: because we’re using cream, we use white wine as the red gives an odd purple flavour. You don’t have to add it if you don’t want to - instead you can just deglaze the pan with water. Cream: I use thickened cream a lot in cooking as it simmers down to good consistency more quickly than pure cream. You could also use cream for cooking, which is more resistant to curdling.  Stock: using just half a cup of chicken stock adds a bit more depth of flavour. It also means the sauce can simmer and absorb flavours for just a bit longer without the sauce becoming too thick. Spinach: baby spinach leaves cook quickly. Just stir them through the sauce until just wilted to retain colour and freshness.  Basil: I’ve gone in hard with the basil, using a full cup. When buying, give the bunch a sniff. It should smell sweet and not of aniseed.  Bread: choose a crusty woodfired bread and although it uses another pan I love drizzling slices of crusty bread with olive oil and char-grilling until golden. 💡 Tip: Swap the thickened cream for cooking cream if you are making this recipe in advance, as it’s less likely to split when reheating. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester",
    "Classic beef burger recipe\nWhen done right, a beef burger is food for the soul, but so often the burger you order can be a massive disappointment: dense bread with a dry patty, limp lettuce and not nearly enough sauce. Take all the guesswork out of the equation and start making your own burgers at home. This is our fail-proof beef burger recipe With this foolproof recipe we give you all the tips and tricks to creating mouth-wateringly good beef burgers every time. Lightly toasted buns are spread with piquant American mustard that anchors the lettuce and tomato, ready to be topped with a perfectly seasoned, juicy beef patty, covered with tangy cheddar cheese. The genius trick in this beef burger recipe is that the onion is grated, rather than chopped, before being added to the mince. The juice from the onion both seasons the mince while adding moisture. This prevents the burger drying out. Perfect for a weeknight dinner or weekend barbecue, this basic beef burger recipe proves that true greatness often lies in simplicity. Want a beef burger but want to make it a little bit healthier? Our low-fat healthier cheeseburger has less fat and more fibre than the regular version, but it’s still big on flavour. We’ve also got loads more burger recipe ideas, so you can find the burger for you – whether it’s gourmet or basic, and for meat lovers or vegetarians. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester",
    "Creamy chicken pesto pasta recipe\nI love it when I have recipes in my repertoire that are easy enough for a mid-week meal, yet I can also serve it to guests (they don’t have to know it’s easy, right?). This is one of my favourites. Why I'm always making this creamy chicken pesto pasta recipe First thing to love about this creamy chicken pesto pasta recipe is that it’s made in only one pan! The pasta is cooked, drained and then it goes straight back into the pot. In go the remaining ingredients and voila! Dinner is on the table. Another thing to love is that it uses ready-made supermarket ingredients; a roasted chicken, sun-dried tomatoes and bought pesto, yet when it’s all tossed together it tastes restaurant quality. 💡 Tips: adapt this recipe to your dietary requirements This is a really versatile recipe. You can double the pesto and get rid of the cream or serve it without the chicken for a hearty vegetarian main. If you want to go all-out and roast your own chicken, then go for it! I've  recommended my favourite roast chicken recipe in the notes section below the recipe. Key ingredients in our creamy chicken pesto pasta: Penne pasta: penne is the ideal shape for holding the creamy sauce, but you can of course choose another type of pasta that you happen to have in the pantry. Creamy pesto pasta sauce works well with most pasta shapes. Light cream: we use light cream to make this pasta all the more luscious, but you can omit the cream and double the pesto if you don't fancy using cream. Basil pesto: we take a welcomed shortcut by using store-bought pesto, but you can make your own fresh pesto if you're feeling ambitious or have basil to use up. Green onions: green onions go into the pasta and form a garnish, too. If you don't have green onions, you could substitute for chives instead. Shredded roast chicken: we use skinless shredded roast chicken, but you can certainly omit the chicken to make a vegetarian version. Sun-dried tomatoes: those little flavour bombs have made a major comeback and bring their umami-rich sweetness to the fore. Parmesan cheese: finely grated parmesan adds its delicious salty, cheesy profile to the plate. Additional recipe notes by Alison Adams, Food Writer and Recipe Tester How to make easy creamy chicken pesto pasta: get the full recipe below",
    "Air fryer roast pork belly\nYou've not had roast pork until you've had roast pork from an air fryer. it's prepped in 5 minutes and on the table in an hour - and that crackling is something else! What's the best way to cook pork belly in an air fryer? The trick is to use two different cooking times. Firstly, start high to get that crackling nice and crisp - just how pork crackling should be! Then cook it lower so the pork retains its juiciness without the meat drying out. What we're aiming for here is dry crackling skin, but perfectly moist pork meat underneath. There's no need to boil or par-boil your pork first before adding it to the air fryer with this method, making it quicker and easier (and one of my favourite new ways to cook pork belly). Once you've mastered this recipe and you want to try new flavour combos, I highly recommend trying Matt Preston's air fryer pork belly bites with spiced, sticky dipping sauce. If you've not yet jumped on the air fryer bandwagon and this recipe has whet your appetite, check out Taste Test Kitchen's pick of the best air fryers to buy in Australia.",
    "Zucchini fritters\nZucchini fritters are a delicious and easy way to use up your summer squash excess. These crispy fritters are a perfect side dish, appetiser, or even a light lunch. The shredded zucchini soaks up the herbs and spices to give you a bite that is just bursting with flavour. The best thing about this recipe is how simple it is to make. In just two steps you have gorgeous, golden brown zucchini fritters. And, while this recipe is guaranteed to work as is, feel free to add your own twist. Lots of our reviewers have already tried experimenting with some other ingredients: chilli flakes, oregano, ground cumin, paprika and corn - nothing’s off limits! What’s more, the ingredients are ones that you often find in your pantry, meaning there’s no need for a last-minute panicked dash to the shops! Love a fritter dinner? Here's 50 fantastic fritter recipes for your fritter fix. And, you could also try our air fryer fritters too.",
    "Sri Lankan beef and coconut curry\nInspired by the bold flavours of Sri Lanka, this beef and sweet potato curry is hearty and packed with spice. Serve with roti and rice for extra texture.",
    "Chicken and mushroom risotto\nAh risotto, whether served on its own or as an accompaniment to osso bucco, it’s one of the great comfort foods Italy has given us. But somewhere along the way, making a traditional risotto got the reputation of being too labour-intensive and difficult. Which led to the rise of baked and microwave versions. While these are both great time savers, there’s nothing like the real thing. With our recipe and tips, we’ll show you just how easy it is to achieve the perfect risotto, with tender pieces of rice suspended in a thick creamy stock. You can use this recipe as a template and add your own twist. Our members have added chorizo and pumpkin and even garlic prawns.  Why we love this chicken risotto recipe Our chicken risotto recipe makes enough for eight people, so half for dinner and the rest goes into the freezer (see tips below) or store in the fridge for another ready-made dinner or to make a batch of arancini.  We also love how the natural starch from the rice mixes with the stock and parmesan making it creamy without using any cream! What do you need to make this perfect chicken risotto? Stock: Although you can make your own stock, because you need ten cups It’s better to use the cheaper supermarket stuff. Save the homemade stuff for a recipe that requires less.  Butter: Butter is an important ingredient as it not only provides that dairy flavour to go with the cheese, it is the perfect medium for the initial toasting of the rice, helping achieve the glossy opaque look that defines the final product.  Onions: Brown onions are the way to go as they are suited to dishes that cook for a while. Save your red and white ones for salads. Make sure you finely chop the onions so they mimic the size of the rice grains.  Rice: For the perfect risotto you need to use an Italian rice with a high starch. The most readily available is arborio. Carnaroli and vialone nano are slightly more expensive but do arguably make a creamier risotto. It’s up to you. Wine: Wine is an important ingredient when making your own risotto. It is the first liquid that goes in, adding flavour as it simmers until reduced. While white is customary, I’ve made risotto with both champagne and red wine instead. Chicken: This recipe uses chicken thigh fillets as they are loaded with flavour and very forgiving,  meaning they can be overcooked without affecting the enjoyment of the dish.  Herbs: We use fresh thyme due to its affinity with both chicken and mushrooms. You could also use rosemary or tarragon. Parmesan: It is the parmesan cheese that melts into the stock to make the dish rich with an almost creamy texture. Finely grate it on the side of a box grater. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to cook our chicken risotto: full recipe below",
    "Air fryer chicken schnitzel\nDip the chicken breast in a mixture of panko breadcrumbs and parmesan before air frying for 15 minutes. It's the only schnitzel recipe you need from now on!",
    "Our go-to vegetarian lasagne\nEach year at taste.com.au we're seeing more and more searches for 'vegetarian dinners'. As a vegetarian of more than two decades, I'm all for it. I've tried my fair share of vegetarian lasagne recipes over the years, ranging from the flavourful and hearty to those that feel like an afterthought. This one? It's not just for the vegetarians. It's everything you want in a warming winter dinner, and more. And, it makes the best leftovers (you'll be fighting for the remaining slice with even the most carnivorous eaters in your home!). Why I love this vegetarian lasagne recipe Entertaining a vegetarian or feeding a crowd? This is your new favourite vegetarian dinner recipe. First, take one look at that luscious, creamy topping made golden brown by bubbling-hot mozzarella cheese, and you know you're in for a comforting dining experience. And yet, there's more than comfort and carbs to this lasagne: it's filled with 7 types of vegetables (yes, 7!) that make for one robustly flavoured and delicious dinner. Make this one on a Sunday night, and come Monday lunchtime you'll be thanking yourself, again! Compliments to the chef (that's you). What's in our vegetarian lasagne? Meet the key ingredients: Pumpkin: we use butternut pumpkin, and bake it before it goes into the lasagne, to bring out its sweetness and ensure it's beautifully tender before it's layered up. Oil, onion and garlic: we use olive oil, a brown onion and garlic cloves to form the building blocks for a flavourful feast, right from the start. Capsicum: red capsicum brings its savoury-sweet flavour to the mix. You could use a yellow capsicum, at a stretch, but red is the best fit for this lasagna. Zucchini: this versatile vegie will ensure you're getting your greens in our meat-free lasagne. It's sliced (rather than greated) to ensure you're not getting a soggy result! Eggplant: this nightshade is a feature in many great Italian dishes (think parmigiana) and is a great, hearty addition to lasagne. Mushrooms: say hello to umami minus the meat, thanks to the inclusion of mushrooms. Tomatoes: a tin of finely diced tomatoes (we love the Mutti kind) do much of the heavy lifting when it comes to flavouring our lasagna. Baby spinach: bolstering the nutritional value and hearty nature of our vegetarian lasagne is baby spinach. Butter, flour and milk: here's looking at you, roux! This powerful trio creates the creamy white sauce that swathes the top of our lasagne. Mozzarella cheese: grated mozzarella cheese is responsible for that iconic golden-brown glow that'll have you considering making a double batch. Lasagne pasta sheets: we use easy-to-source dried lasagne sheets to layer up this beauty. Seeing more vegetarian dinner recipe ideas? Look no further than our inspiring vegetarian dinner round-up that takes you from bakes to bowls and from pies to pastas. Introduction and recipe notes by Food Writer and Recipes Editor, Sonya Gellert.",
    "Classic fluffy Australian corn fritters recipe\nIf there’s one meal that gets everyone’s approval in the family, it has to be corn fritters. It’s not surprising really: the sweetness from the corn and tang from the feta, the crisp edge after cooking and, of course, that fluffy, airy inside. This is one of those classic brunch recipes that works at any time of day. It's absolutely delicious and yet so simple to whip up. They're crispy on the outside and fluffy on the inside, like every good corn fritter ought to be! Why is this our best corn fritter recipe? What we love about our corn fritter recipe is that it’s the perfect base on which to add your own variations. You can replace the canned corn for creamed corn (keep in mind this may make the batter more liquidy) or use fresh corn straight from the cob. Some of our readers even like to switch out one can of corn for chopped capsicum and zucchini. When it comes to serving, the corn fritters pair perfectly with condiments like sweet chilli sauce and ingredients such as avocado and a sharp bite of rocket. 💡Tip: prep ahead Whether you're looking for a ready-to-cook brunch or a quick midweek dinner, you can make your corn fritter batter ahead of time. See our recipe notes (below the recipe) to find out how. What's in our best corn fritter recipe? Flour: self-raising flour gives that iconic height to our Aussie-style corn fritters. Eggs: not only a great binder to keep our fritters from falling apart, trusty eggs also boost the nutritional value of this simple fritter recipe. Milk: bringing moisture to contribute to our fluffy corn fritters, milk is a must-have. We've used regular cow's milk, but you can really use any milk you prefer. Corn: we use canned corn for both its sweet flavour and convenience, but you can certainly use fresh corn if you have some to use up. Chives: chopped chives bring fresh pizazz to our fritters, but you can also use green onions if you have them in the crisper (or parsley, if you like!). Fetta: the salty, tangy depths of fetta really bring a new dimension to our favourite fritter recipe. Trust us on this one! Butter: we fry our fritters in butter for that extra crisp edge. Yum. Avocado, rocket and sweet chilli sauce: we serve our fritters up classic Brunch or cafe-style with avocado, peppery rocket and a dollop of sweet chilli sauce (which is a lovely match for the sweet corn and salty fetta). If fritters are a favourite in your home, try these fritter recipe ideas on for size, including our impressively easy giant skillet haloumi and zucchini fritter. Additional recipe note by Alison Adams - Food Writer and Recipe Tester",
    "Chicken and sweet corn soup recipe\nWhenever I got sick as a kid, Mum would always offer to make me a bowl of chicken and sweet corn soup. While some may say it’s a placebo effect, I believe that this bowl of soup is a miracle worker. The subtly salty chicken consomme is infused with sesame oil, soy sauce and ginger (which has numerous health benefits) and the flavour profile gets even more complex thanks to the sweet flavours of creamed corn and the addition of savoury egg whites and ham. To me though, it truly just tastes like nostalgia. Why do we love this chicken and corn soup recipe? One of my favourite things about this soup is how quick and easy it is to prepare, even with the added ingredients that aren’t usually found in a traditional chicken and sweet corn soup! Even when I’m not sick, I often find myself turning to this recipe when I need a bit of a pick-me-up.There’s a reason that so many people turn to chicken soup - it really does warm both your stomach and your soul. Key ingredients in our chicken and corn soup: Chicken consomme: don't be thrown off by the term 'consomme.' Chicken consomme is a richly flavoured chicken broth, and using a liquid chicken stock will achieve the same delicious result in this recipe. Chicken breast: it would hardly be a chicken soup without tender pieces of chicken breast throughout. We use two breasts across 4 serves of soup. Soy sauce: adding a salty depth to this soup, soy sauce provides a little instant umami kick. Ginger: fresh, grated ginger contributes to the soothing nature of this soup, that feels like salve when you're under the weather. It also brings its vibrant bite to the broth. Cornflour: helpen to thicken this traditionally thin soup, cornflour makes for a lovely consistency. Creamed corn: sweet and creamy, creamed corn is a key player in this soup and a budget-friendly ingredient, too. Can corn kernels: we add canned corn kernels as they hold their shape well, have that signature sweetness that rounds out the salty broth, and give a little extra crunch to the corn soup. Shaved ham: just like in a pea and ham soup, salty ham balances the flavours out here. It's a great pairing for the sweeter corn in this recipe. Egg whites: whisked egg whites add further protein and thicken this corn soup, putting it in the category of an 'egg drop soup'. You can read more about adding egg to soups in our recipe notes below the recipe. Sesame oil: sesame oil is used to season and dress the soup, rather than to cook any ingredients. It's rich, nutty flavour is a delicious addition to the soup. Green onion: sliced green onions bring a vibrant burst of fresh flavour and colour to finish the chicken and corn soup. If you love chicken soup, we have plenty of chicken soup recipe ideas to keep you inspired all winter long, and a collection of slow cooker chicken soup recipes to make your evening that little bit easier. How to make chicken and corn soup: full recipe below",
    "Creamy fettuccine carbonara\nSome nights when craving the umami bomb that is carbonara without the guesswork I turn to this recipe. It’s perfect! The clever addition of cream stabilises the egg mixture, giving you the authentic taste with a safety net! We we love this creamy fettuccine carbonara recipe I can see the purists out there raising their fists. Yes, I know, I know - carbonara recipes don’t traditionally have cream in them! But depending on my mood I sometimes like to add it. When I’m calm and focussed, I go the authentic route; where hot pasta is added to a mixture of egg and finely grated parmesan and gently tossed off the heat until a silky sauce forms, lightly covering the pasta strands. It’s not necessarily difficult, you just have to ensure the eggs aren’t over or under cooked. What's in our creamy fettuccine carbonara recipe? Fresh fettuccine pasta: I personally love using fresh pasta as it just tastes SO GOOD but you can of course use dry fettuccine as well. Light thickened cooking cream: stabilises the egg mixture, giving you the authentic taste with a safety net! Eggs: the egg yolks are there to add extra richness binding with the fat from the bacon creating that signature sauce. Seeking further carbonara inspiration? Try this spaghetti carbonara next.",
    "Tuna pasta bake\nAhh, tuna bake. Where would we be without it? Ticking all the boxes: simple, budget-friendly, family friendly and made from at-hand ingredients, this tuna bake recipe’s one of my favourites. What we love about this tuna bake recipe It’s carby, creamy and cheesy but with a couple of substitutes that creates a better-for-you version. This is a tuna bake for all the family. There are no vegetables for the fussy eaters, but you can serve it with a salad or a bowl of steamed greens. I love the way the tiny flakes of tuna find their way into the macaroni pasta and that it’s on the table in just over half an hour. This tuna bake also freezes perfectly and is excellent eaten hot or cold the next day for lunch. Key ingredients in our tuna bake recipe: Macaroni pasta: if you don't have macaroni pasta, you can use other small pasta shapes instead. (Just avoid long shapes, like spaghetti). Salted butter: full fat salted butter adds flavour, rounding out the other low-fat dairy products. Plain flour: flour thickens the sauce, helping to create that creamy, silky texture. Milk and cheese: the milk and cheese are both low fat, and yet the dish still feels comforting and indulgent. You can of course use full-fat dairy ingredients instead. Tuna: the tuna is packed in springwater, not oil, making it a lighter choice. Love this recipe? Try your hand at these fabulous, kid-friendly pasta bakes to please all ages, this much-loved healthy tuna mornay bake or this better-for-you tuna pasta bake with tomato. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make tuna pasta bake: full recipe below",
    "Our best pad Thai recipe\nGet a taste of Asia's south-east with every bite of this easy pad Thai recipe. Making pad Thai at home might just be simpler than you'd expect, and this pad Thai recipe has all the hallmark flavours of a traditional Thai cooking. It really is an amazing recipe - be it a weeknight delight or a dinner party pleaser. Why is this our go-to easy pad Thai recipe? This pad Thai recipe sees you get your Thai take-away fix at home! Few dishes boast the flavour of a tangy pad Thai sauce covering flat rice noodles. Combining chicken and prawns, this delicious noodle dish with its flavourful pad Thai sauce is jam-packed full of nutty, salty and sweet goodness, thanks to the addition of peanuts, brown sugar and fish sauce (the ultimate pad Thai sauce combination, in our humble opinions!). Key ingredients in our pad Thai Rice noodles: the soft yet toothsome texture of rice noodles is the perfect base for soaking up the many flavours in pad Thai. Lime juice: an ingredient that features in many Thai dishes, lime juice brings its vibrant sweet-sour tang to this noodle recipe. Fish sauce: fish sauce is an ideal sauce for bringing a rich umami depth to Thai food. You can also buy vegetarian versions of 'fish' sauce if you're hoping to make a vegie version of this dish (with tofu). Brown sugar: complementing the sour lime juice and umami-rich fish sauce, brown sugar sweetens the pad Thai sauce. Peanut oil: ideal for coating the noodles, peanut oil also adds a nutty flavour. Chicken and prawns: we use both chicken and prawns in this recipe, but you can also substitute with tofu if you'd like to make a meat-free version. Green onions: green onions bring added bite to pad Thai, and you can adjust the quantity to suit your preferences. Red chillies: some like it hot, but some do not. You can cater to your own heat preferences but adding as much or as little chilli as you like to the sauce. Eggs: whisked eggs add even more protein to this much-loved meal. Bean sprouts: while you can omit bean sprouts if you're unable to get them, this ingredient adds a satisfying crunch to the recipe. Peanuts: for further texture, chopped peanuts are a great topping for pad Thai, and complement the peanut oil in the recipe. Coriander: we all know someone with the coriander gene who can't stand the stuff. While coriander is a lovely flavour match and spot of greenery to garnish the meal, if you're catering to a coriander-hater, you can omit it. Love a flavourful noodle recipe? Try our sticky pork pad Thai, our vegetarian pad Thai recipe with firm tofu, this spicy prawn pad Thai for those who like it hot, our delicious pad Thai egg rolls, and our pad Thai rice recipe (complete with pad Thai sauce). Recipe notes by Sonya Gellert, Recipe Editor and Food Writer How to make pad Thai: full recipe below",
    "Warming chicken soup recipe\nHistory is dotted with references to chicken soup. Since the 2nd century AD, different cultures simultaneously realised that chicken plus water and a handful of vegetables equalled flavour, comfort and a general feeling of well-being. What makes this our best homemade chicken soup recipe? With this express chicken soup recipe, we skip the simmering-a-whole-chicken-in-water bit, instead poaching thigh fillets creating a full-flavoured chicken broth in half the time. With spicy whole peppercorn and a final flourish of fresh parsley, this chicken soup recipe will warm the cockles of your heart. Key ingredients in our chicken soup recipe: Chicken: thigh fillets bring brothy, full-flavoured soup to the table faster. Vegetables: carrot and celery join forces with onion and garlic to add instant flavour and up the nutrition factor of this classic, feel-good soup. Fresh herbs: take a shortcut to tasty town with fresh continental parsley and fresh thyme sprigs, that give added depth to your broth. Black peppercorns: the secret ingredient that makes this a winner, winner, chicken (soup) dinner, is the gentle heat and warmth of peppercorns. Trust us, they works a treat! Discover more of our favourite chicken soup recipe ideas, including a wonderful chicken noodle soup, and dive into our slow-cooker chicken soup recipes (well, not literally of course). Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make this chicken soup: full recipe below",
    "Easy and delicious paella recipe\nPaella is one of the most loved (and well-known) dishes of Spain, and for good reason; it’s packed full of flavour, it’s filling, and can be customisable depending on what proteins and vegies you have on hand. At its core, a homemade paella is a delicious rice dish loaded with all the good stuff: think capscicum, tomato, parsley and a gentle sprinkling of spices. We also use turmeric to give this simple paella recipe its signature yellow rice hue. Chicken and chorizo form the meaty components in this paella recipe, but once you have your simple paella recipe base, you can play with your choice of add-ins when you next make paella. Why is this our best easy paella recipe? We’ve simplified the traditional Spanish rice recipe a little to make it perfect for busy weeknight dinners. So if you want to get all the flavours of the Valencia-born recipe at home without any fuss, this one is definitely worth a try. Featuring chorizo, skinless chicken thighs, white rice, chicken stock (or chicken broth, if you have it) and spices like turmeric and cumin, this hearty dinner will be ready to eat in under an hour. And don’t worry, you won’t be needing a paella pan. Though a paella pan is the traditional choice, any large pot or pan in your kitchen should do the job nicely. This might not be the image of an authentic paella rice dish, but it certainly is a delicious midweek meal. Key ingredients in our paella recipe: Chorizo sausage: while chorizo mightn't be a traditional addition to paella, it's an instant salty flavour hit that works really well in this speedy weeknight-ready recipe. If you don't love chorizo you can leave it out. Chicken: an easy protein-boosting addition to our homemade paella, we use chicken thighs (trimmed) in this dish. Onion and garlic: it would hardly be Spanish cuisine without onion and garlic to bolster the flavours. Red capsicum: colour, flavour and nutritional value, to boot! If you only have a green or yellow capsicum on hand, you can stray from tradition and add those instead. Ground turmeric: this easy, speedy and budget-friendly paella gets its yellow hue from a little ground turmeric (seeya, saffron!). Ground cumin: deepening the flavours of your paella, is a little cumin for added kick. White rice: good old white rice serves as the vessel for all these flavourful ingredients, and makes for a hearty meal. Diced tomatoes: for a long time, tomatoes and Spanish dishes have gone hand in hand, and canned diced tomatoes bring moisture to the rice. Stock: we use a chicken-style stock in this recipe, but you can substitute with another stock if you're out of this variety. Frozen peas: another budget-stretching ingredient that brings protein, extra veg and greenery to homemade paella is the freezer staple, frozen peas. Parsley: fresh, flat-leaf parsley leaves are the final touch to top this homemade paella. For a vegetarian variation, try our one-pan vegetarian paella, that's bound to please a crowd. We also have a nifty prawn-topped paella tray bake recipe, and our party-in-your-mouth chicken, chorizo and seafood paella. Plus, try these 17 recipes that will make you want to move to Spain, and these dinner ideas that use canned tomatoes (hello, budget-friendly bulked-up meals!). Recipe notes by Sonya Gellert, Recipes Editor and Food Writer How to cook paella: full recipe below",
    "Easy oven-baked frittata recipe\nMy most memorable frittata experience was in Florence. Wandering through the streets I found a little hole-in-the-wall lunch place that had lines of frittata-stuffed panini on display. With just a lick of mayo and a sprinkling of rocket, I continued my journey, thinking this was the most inspired sandwich ever! I’ve been playing around with frittata recipes ever since and I’ve hit payload with this baked frittata recipe. It’s a chunky, cheesy, protein hit. Why is this such a great, easy frittata recipe? In this easy frittata recipe, the potato provides the carbs making it a nice, filling dinner and I love the fact that I can adapt it depending on what’s in my fridge. As long as I have eggs and cheese I’m set to go. What I also love about this frittata recipe is that it’s baked. That means the oven takes care of it rather than me having to tend to it on the stove top. And the leftovers from this baked frittata recipe are perfect for lunch, served in a panini if the mood takes you! It's absolutely delicious. You can enjoy this easy recipe served immediately, fresh and hot, serve warm, or at room temp. Leftovers make an enticing healthy breakfast too. Key ingredients in our frittata Sebago potatoes: like a Spanish tortilla, our frittata includes cooked potato, which is thinly sliced and layered with the onion mixture. Red onion: a shortcut to flavourful frittata, red onion is cooked with the pancetta and spinach in the pan. You could use a brown onion if you don't have a red on hand. Pancetta: salty, umami-rich and tasty, pancetta does for this frittata what bacon does for zucchini slice. And, if you can't source pancetta, you can use bacon instead. Vegetables: baby spinach, red grape tomatoes and red capsicum bring colour, flavour and added nutritional value to our frittata. Eggs: a key ingredient in any frittata, eggs make light work of this delicious dinner-turned-snack (literally holding it all together!) and pack the recipe full of protein, too. Thickened cream: making this frittata a little more indulgent, thickened cream is whisked into the (8!) eggs, turning a simple dish into an especially comforting one. Cheese: creating a golden, cheesy top to complete the frittata, shredded parmesan and grated tasty cheese are sprinkled over the layered dish before baking. Though we have a feeling this is the only frittata recipe you'll want to use from now on, if you love a basic frittata recipe, try our best frittata variations, including our favourite mini frittatas, this salmon frittata, our better-for-you frittata and this healthy frittata traybake. How to make frittata: full recipe below",
    "Our favourite lentil dhal recipe\nIndia produces some of the best vegetarian recipes in the world. From onion bhajis and vegetable samosas to saag paneer and vegetable korma. When you have such intense flavours, meat often seems a bit redundant. One of the most popular staples of Indian cuisine is dhal (often spelt dal or dahl). What goes into a lentil dhal recipe? While often served as a side dish in a restaurant, our lentil dhal recipe is a comforting meal in itself. With a rich buttery taste, the lentils are cooked down until super tender then spiked with sweet spices and a touch of chilli. Despite its diverse flavours, our favourite lentil dhal recipe is made entirely from easily sourced supermarket ingredients and is ideal for meat-free Monday or eat-on-the-couch Sunday (yes, it’s a thing). Need to bulk-up your dahl? Try our red lentil dhal with sweet potato for a robust meal. For more meat-free dinner ideas, allow our collection of Indian vegetarian dinner recipes to pique your appetite. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester",
    "Delicious and simple savoury mince recipe\nSimple savoury mince recipe When you think about it, savoury mince is an odd term as pretty much all mince dishes are savoury (unless you’re Rachel from Friends who got the pages of her cookbook stuck together and made a combination of trifle and shepherds’ pie for Christmas lunch). That particular dish aside, savoury mince is usually a warm and hearty dinner – and was a regular on the table for me growing up in rural Australia. Tender mince cooked with colourful crisp vegetables, thickened just enough to hold its shape when spooned over rice or on thick buttered toast. The word comfort doesn’t do it justice. And it’s not the only retro mince recipe making a comeback. What secret ingredient goes into our savoury mince recipe? While savoury mince is usually thickened with flour, the secret to our favourite savoury mince recipe is the addition of a couple of tablespoons of Gravox. This not only thickens the mixture but adds an extra beefy flavour. Despite being a family favourite, another great thing about savoury mince is that it’s easy on the budget, requires only ten minutes prep and you can add whatever is in the crisper drawer, making it a great use-it-up meal. Serve it on mash, wedges, polenta, rice or simply on toast. Looking for more ways to make the best of beef mince? Here are our favourite beef mince recipes in one place. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester",
    "Spinach and ricotta cannelloni\nSpinach and ricotta cannelloni is one of our go-to meals for those crazy busy school nights. Ticking all the boxes we require for an easy dinner - kid-friendly, a bit of veg, and guaranteed to result in empty plates at the end of the night - is it any wonder we have one on the go, and one in the freezer at all times? What we love about this recipe is that there is no need to fill individual cannelloni tubes (we use fresh lasagne sheets instead) so it cuts down on the prep time immensely. If you want to up the veg, add some salad leaves on the side, or for little kids, some chopped carrot sticks and cherry tomatoes. If you’re partial to the odd meat filling, like beef or lamb, we have plenty of variations on cannelloni - just check the note sections below for the link.",
    "Hearty chicken and vegetable soup\nThis is the chicken and vegetable soup recipe you need. While all soups offer a certain level of comfort, chicken and vegetable soup takes this to a new level. Chicken and vegetable soup is not just for the colder months. With its magically comforting, elixir-like qualities, this soup can be eaten all year round, whenever the body or soul needs a pick-me-up. Simmering bone-in chicken in store-bought stock deepens the chicken-rich flavour of this recipe, giving it a homemade taste. Slow simmering also brings out the sweetness in the carrot, celery and turnips. These vegetables have the double duty of providing the aromatic base of the soup as well as being ingredients in their own right. The addition of soup mix is the clincher here. Not only does it provide a heartiness in this chicken soup recipe, but it is also a nutritional powerhouse. This chicken and vegetable soup freezes beautifully, ready to be warmed up whenever the body craves it. And, keep the chicken soup inspiration coming with our collection of best-ever chicken soups you’ll be dreaming about until dinner time (like our hot and sour chicken soup with extra kick). Additional recipe notes by Alison Adams - Food Writer and Recipe Tester",
    "Chicken curry\nFrom searing vindaloos to gentle kormas, Indian curries can be as challenging or comforting as your mood or palate dictates. This, our favourite, chicken curry sits somewhere in between. With the pop of spicy mustard seeds and heady fragrance of garam marsala, you can add as much chilli powder as you desire. Some Indian curries are made with a tangy tomato base and others on cream, yoghurt or coconut milk. This curry gives us the best of both worlds. Pieces of chicken are simmered in a spiced tomato sauce until tender and then finished off with rich and smooth coconut milk. Don’t be put off by the ingredient list here, there’s no complicated curry paste to make, instead the spices are simply spooned from their jars straight into the pan. This chicken curry recipe makes a generous batch. Leftovers can be frozen, or how about getting out the pie maker and making crispy little curried chicken hand pies?",
    "Crispy-skinned salmon\nWe have the chef's secrets on crispy-skinned salmon. With our clever tips you won't have to go out for dinner!",
    "Slow-cooker massaman beef curry recipe\nTake your tastebuds on an exotic trip with this authentic Thai curry dish.",
    "Slow-cooker beef stroganoff\nBeef stroganoff started its life as a dish by French chefs for the Russian aristocracy (Count Stroganoff for those playing at home)! Yet it somehow ventured out to America and Australia where it became a midweek meal. Rather than seeing this as a fall from grace, I see it as a compliment to its versatility.  Originally just a dish of beef cooked with French mustard and served with a dollop of sour cream. The evolved recipe relies on beef tenderloin. When cooked properly it’s a beautiful vehicle for the sauce, but these days fillet steak is a special occasion food in my household so enter this ever-popular dish for slow cooker stroganoff. One of the amazing qualities of stroganoff is that it’s basically a quick throw together dish that tastes like a stew, so, it isn’t a huge leap to turn it into one. Using the gorgeous signature sauce ingredients along with the cheaper beef cut of meat, and allowing it to simmer away in a slow cooker, you get the same flavours but with meltingly tender beef. Why we love this slow cooker beef stroganoff recipe Where traditional stroganoff uses an expensive cut of beef, by cooking in a slow cooker means you use the less expensive brisket, which just simmers happily away soaking up the mushroom tomato flavour until spoon tender. As with most slow cooker recipes there’s minimal prep and then its hands off. Just walk away and let the cooker make your dinner.  What do you need for this slow cooker beef stroganoff? Beef: We use brisket but you could also use chuck, gravy beef, blade or topside Mushrooms: Adding mushrooms to beef stroganoff happened later in its journey from Russia, but it’s a logical step. We just halve them as they get a long cook and we don’t want them to disappear into the sauce. Flour: We add a couple of tablespoons of plain flour at the beginning of cooking to allow the sauce to thicken. If you’d prefer a gluten free version, swap it for three teaspoons or cornflour mixed with one tablespoon of water and add in the last ten minutes of cooking. Paprika: Gives an earthy capsicum flavour. If you wanted to add a smoky element you could use three teaspoons of sweet paprika and 1 teaspoon of smoked.  Tomato paste: because tomato paste is just highly concentrated tomato sauce, only a little bit is needed to flavour the sauce.  Worcestershire sauce: The ultimate umami bombs, Worcestershire sauce contains among other things tamarind, anchovy and molasses adding an intense savoury and sweet flavour to our slow cooker strog. Parsley: More than just garnish, parsley is also an ingredient, bringing a bright peppery freshness to the dish. If you have any leftovers, turn them into pot pies! Divide the beef stroganoff among small ovenproof dishes and cover with squares of just thawed, frozen puff pastry. Brush with whisked egg. Bake at 220C/200C (fan forced) until the pastry is golden and the beef stroganoff is heated through. The flavours of stroganoff are so good we believe they shouldn’t be for beef alone so we’ve paired them with chicken, pork, rissoles and even have a vegetarian version. We’ve turned it into a soup, a tray bake and even piled it into a cob loaf. For even more twists check here. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make beef stroganoff in a slow cooker: full recipe below",
    "Hearty beef casserole\nLoaded with tender beef and vegetables our rib-sticking hearty beef casserole is a bowl of comfort for when the nights turn chilly. Serve it with an equally soothing potato mash. While curries can be eaten all year around, there’s something about a traditional beef casserole that screams winter. And this recipe is the real deal. No bells and whistles, instead our favourite beef casserole is just beef simmered in a broth of wine, tomato and stock until mouth-wateringly soft. Peppered with pieces of sweet carrot, this easy beef casserole recipe really hits the spot when craving a fork only dinner, eaten preferably on the couch.   Our popular beef casserole recipe makes a double batch. Half for tonight’s dinner and the remaining can be frozen for later or used as a pie filling.  Why people love this old fashioned beef casserole Our favourite beef casserole recipe is a no-nonsense, down to earth, country-style stew. With only 15 minutes prep, the beef is left to simmer for two hours, the perfect amount of time for it to become spoon tender and allow the flavours to meld. We know that finely chopped onion, carrot and celery (known as mirepoix) is the flavour base for many dishes. In this classic beef casserole, we cut the pieces a bit bigger, so they act as vegetables as well as providing those sweet bass notes.   Nearly every country has its version of a beef casserole. France has its bourguignon. Ireland has their beef and guinness stew and of course everyone loves Hungarian goulash. Asia embraces slowly simmered beef as well, whether in a  Vietnamese Bo kho or a classic Indonesian rendang. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester.",
    "Old-fashioned beef rissoles recipe\nLoved by children, always welcomed at a barbecue, budget-friendly, super versatile and the butt of everyone’s least favourite Dad joke (‘see you round like a…’), good old-fashioned beef rissoles are a family-friendly classic. Whether you pair rissoles with veggies for a simple weeknight dinner, eat them in a fresh white bread roll with tomato sauce (over your lap) at a gathering, or even add them to a salad, these round beef mince balls have become an Australian staple.  There are so many delicious variations on the classic rissole recipe, and taste.com.au is full of well-rounded rissole ideas – from chow mein rissoles to chicken satay rissoles and even a surf and turf rissole tray bake. These days, you can make rissoles in an air fryer for a super speedy meal. Try out this easy rissole recipe then get creative with more rissole recipes.  Additional recipe notes by Sonya Gellert, Recipes Editor and Food Writer",
    "Chicken cacciatore\nChicken cacciatore is more of an idea than a recipe. Translating to hunter’s stew, it was traditionally made on whatever the hunter of the family had gathered – most commonly rabbit or other wild game and whatever ingredients were in the house, but mainly the household passata made from the season’s glut of tomatoes.  Varying from family to family, some recipes may use red wine rather than white, the mushrooms may be swapped for capsicums and capers may be added. In some cases, the chicken may be dredged in flour before being fried off. There’s even a Roman version that doesn’t use tomatoes at all. The great thing about chicken stews is that they cook so much more quickly than their beefier counterparts. With just 15 minutes prep, once the chicken is in the sauce it only takes about 40 minutes for the chicken to become super tender, but it tastes like it’s been simmering away for hours. Serve this earthy hearty family favourite with crusty bread or on a bed of pasta, sprinkled with a smattering of parmesan. Why we love this chicken cacciatore recipe Using just a combination of chicken drumsticks and thighs, this recipe is loaded with the extra chicken-y flavour that bone-in chicken gives at the same time being really easy on the budget. We also love the sneaky addition of balsamic vinegar, which adds an indefinable sweet and sharp edge to the dish.  What do you need to make a great chicken cacciatore? Key ingredients: Chicken: We use a combination of chicken thighs and drumsticks. You could portion up a whole chicken, just add the breast pieces later in the cooking as they cook more quickly than the other parts. Mirepoix: At the heart of Italian and French braises, the combination of finely chopped onion, carrot and celery along with the garlic provides a slightly sweet and savoury flavour base for many stews and casseroles  Pancetta: Using this smoky cured pork adds a salty rich element that gently infuses into the sauce as it simmers.  Mushrooms: Although optional in a chicken cacciatore, we’ve added them to add to the earthy rustic quality of the dish. Make sure you slice them thickly so they don’t overcook. Wine: We’ve used white wine but you can certainly use red instead. Tomatoes: The quality of the tomatoes is important to this dish, with some cheaper cans being a bit watery. Mutti is an excellent brand. You can use either their passata or polpa.  Herbs: This cacciatore recipe uses fresh rosemary and bay leaves, but you could use thyme or sage or even a hit of dried oregano. Olives: The olives add a salty kick to the stew. While we’ve gone for Kalamata, you could use the larger green Sicilian type. We have a few twists on chicken cacciatore on the taste.com.au site. there’s a super quick version that is made on thigh fillets and an even more budget-friendly version with rissoles as the hero. Contain the cooking to the oven with our cacciatore traybake or pasta bake. Vegans don’t miss out with this tomatoey pasta version and we also have a  better-for-you recipe Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make chicken cacciatore: full recipe below",
    "Slow-cooker roast lamb\nThis Greek-style roast lamb from one of our taste members is meltingly tender and so simple to make.",
    "Delicious meatloaf recipe (our team's favourite!)\nLoaf pan at the ready! Few dishes evoke nostalgia and comfort more than  a delicious meatloaf recipe. When done properly it warms the heart, with flavourful juicy meat covered with a sweet and tangy topping, demanding to be served with a creamy mash. For those who may have had a disappointing experience, this is the super tender meatloaf recipe to change your mind. Why is this our best meatloaf recipe? We’ve swapped dry breadcrumbs for fresh and added pork and veal mince to the ground beef mince to ensure this homemade meatloaf recipe makes a soft and tender, yet firm enough loaf to slice without crumbling. And, while the sweet tomato sauce glaze (a delicious sweet and tangy glaze if ever there was one!)  Tomato sauce adds extra juiciness, but serving this meatloaf recipe with gravy takes it to another level. All the hallmark secret ingredients make this meatloaf recipe a winner. What’s more, if you have any leftover cooked meatloaf in the loaf pan, they get a new life in a meatloaf sandwich with fresh white bread and loads of butter. Who doesn't love meatloaf sandwiches? But, we regret to inform you, we're almost certain that with this meatloaf recipe leftovers are unlikely. Key ingredients in our meatloaf Onion and garlic: that formidable, flavourful duo is an instant recipe booster, and brings added depth to this meatloaf. Breadcrumbs: while we use fresh breadcrumbs, you can use dry breadcrumbs if that's what you have. Mince: we use both veal and beef mince for added flavour and a winning meatloaf texture. Wholegrain mustard: a little touch of grainy mustard adds a lovely kick to this recipe. You can use another mustard if you don't have grainy, but we love the texture of wholegrain mustard. Worcestershire sauce: that classic weapon, Worcestershire sauce deepens the umami-rich profile of our classic meatloaf. Tomato Sauce: tangy, sweet and a non-negotiable, tomato sauce is delicious addition to any meatloaf. Brown sugar: lending its caramel-like sweetness to the loaf, a little brown sugar makes all the difference and balances out the savoury ingredients. We have a collection of varied and absolutely delicious meatloaf recipe ideas! Try our hidden-veg family meatloaf and this creative spanakopita meatloaf! To get the absolute best from your meatloaf recipe (with moist, juicy results every time), read the tips in our recipe notes section below. How to make meatloaf: full recipe below",
    "Potato and leek soup recipe\nAlong with minestrone, pumpkin and chicken, potato and leek soup is up there as one of the classics. And is it any wonder: it’s warming, nourishing and super easy to make. Why we love this potato and leek soup recipe Unlike other potato and leek soup recipes, our version only requires a handful of ingredients. It starts with an aromatic base of garlic and onion (like so many traditional French recipes do), with potato, leek, stock and cream added after. Just remember, if you are making this ahead, only add the cream just before serving so it doesn’t curdle. We’ve provided two options and instructions for blending your soup - a blender and a stick blender - to help prevent it from going slimy. What we love about potato and leek soup is it’s a great way to up you and your family’s vegetable intake, as well as add your own variations (we even like to add bacon at times). Key ingredients in our potato and leek soup: Onion and garlic: the building blocks that flavour this delicious soup, onion and garlic are softened in olive oil. While we like the gentle balance of flavour here, you can add a little extra garlic, if you want a richer flavour. Potatoes: we suggest using 4 medium (or about 700g) of desiree potatoes to create the ultimate, creamy soup consistency. If you can't get desiree potatoes, you can use pontiac potatoes instead. Leeks: it's best to use the pale parts of the leek with their milder, sweet and aromatic flavour, than the more strongly flavoured bright green ends. Stock: we use vegetable stock to keep this recipe vegetarian, but you can use chicken stock if you have it. Cream: thickened cream turns this soup into a swoon-worthy bowl of joy. Think we're exaggerating? Try it and see! Bread: to create croutons, we fry 3 thick slices of day-old white bread, crusts removed, cut into 2cm cubes. It doesn't have to be 3 days exactly, but you don't want super fresh bread for this purpose. For more soup recipe inspiration this season, try this creamy cauliflower soup, this super greens soup and our easy pumpkin soup. How to make potato and leek soup: full recipe below",
    "Easy beef chow mein recipe (with video)\nMove over, takeaway beef chow mein. This homemade beef chow mein recipe is easy to make (and even easier to eat!) Why do we love to make easy beef chow mein at home? Made with quick and easy supermarket ingredients, including fresh egg noodles (but you can also use dried if that’s what you have in your pantry), vegetables and a delicious sauce, made from soy and oyster sauce, is it any wonder chow mein is one of our most popular recipes on taste.com.au (and around the world)? Perfect for kids and adults alike, our beef chow mein recipe uses ground beef mince, so it’s cost-friendly, and has pak choy in place of cabbage, for extra crunch. Yum! If you love recreating Chinese food at home, give our sticky Chinese pork stir-fry a try, our toothsome Chinese barbecue pork, and check out our collection of crave-worthy Chinese recipes you can make at home.",
    "Our favourite classic apricot chicken recipe (with video)\nSome things are just better together, and there's something to be said for the combination of juicy apricots and chicken. Apricot chicken is a classic recipe, and we'll likely never stop cooking it. But this apricot chicken recipe is our firm favourite for good reason. It's the OG, the best ever apricot chicken and we won't be persuaded otherwise! Sweet apricot nectar brings so much flavour to this recipe, alongside Moroccan spices (instead of the old go-to French onion soup mix). Why do we love a classic apricot chicken recipe? Budget-friendly, easy to make at home and full of savoury meets fruity flavour, this apricot chicken recipe is hard to beat. The 1970s saw us getting pretty creative with our dinners, especially when it came to adding fruit to savoury dishes. Ham steaks Hawaiian (grilled ham with pineapple) was on high rotation in our house, my mother would set grated carrot in orange jelly and serve as a side at barbecues, and restaurants were serving up duck a l’orange. And then there was apricot chicken. Before the (brilliant) invention of ring pull cans, we were at the mercy of can openers. In the case of cans of apricot nectar, we used the pointy part of the can opener to pierce two holes on the top of the can to allow the thick syrup to glug into the frying pan. The remaining nectar was stored in the fridge where we’d sneak decadent sips straight from the can. This apricot chicken recipe is a twist on the one mum made, swapping the French onion soup for Moroccan spice mix to create a sweet and savoury apricot chicken sauce - this is the comfort food of my childhood with a bit of a grown-up edge. Thanks to recipes like this we’ll be eating apricot chicken for generations to come. We serve this one with couscous, but you can serve with rice if you prefer. You can also make this delicious apricot chicken recipe in the slow cooker. (See recipe notes below!) When you make apricot chicken, be it in a slow cooker or in a baking dish, your house will fill with the incredibly alluring scent of apricot nectar, spices and very juicy fruit. It really is a delicious meal. We serve it with couscous but many home cooks love to serve this delicious dinner with mashed potato. Looking for something speedy? Try our 10-minute sticky apricot chicken recipe. Try this crispy crumbed apricot chicken tray bake, and these 50 easy chicken dinner recipe ideas for time-poor cooks. Additional notes by Alison Adams - Food Writer and Recipe Tester",
    "Comforting classic moussaka recipe\nOur classic Greek moussaka recipe epitomises the richness and comforting nature of hearty Greek fare. For me, this recipe brings back memories of childhood dinners (the kind everyone at our table would gladly eat!). What's in a traditional moussaka recipe? A classic family-friendly dish from the Mediterranean, moussaka is classic comfort food, which we happily eat all year round. It consists of layers of pan-fried eggplant, a thick, rich lamb-tomato sauce, and a topping of deliciously creamy bechamel sauce. Do you need to salt eggplants before making moussaka at home? Many recipes call for eggplants to be salted and rinsed to draw out any bitter juices, but this shouldn’t be necessary if they’re fresh. If the seeds are too defined or feel hard, the eggplant may be old and should be salted. If you love comforting Greek dishes, you'll love these 14 Greek recipe ideas. And, if you're hungry for more moussaka recipes, sink your teeth into our slow-cooked beef moussaka, our cheesy moussaka pasta bake and this vegetarian moussaka made from lentils.",
    "Creamy mushroom risotto recipe\nMeet our go-to mushroom risotto recipe Risotto is a dish that originates from Northern Italy and is considered a staple meal on dinner tables across the region. Why has this creamy mushroom risotto become our favourite? We love this mushroom version as it has a big umami flavour with welcoming hits of garlicky butter - oh, we’re drooling just thinking about it. If you’re afraid to make this classic Italian dish because you’ve heard it’s complicated or you fear you’ll end up with a soggy porridge–like mess at the end, fear not, this fail-proof recipe is for you. Why is this an easy risotto to make? We’ve tested it so many times to ensure the perfect rice-to-liquid ratio for creamy, silky risotto. Our best step is not to over-stir - you just want to ensure that no rice is sticking to the bottom of the pan - or overcook it. If you follow this advice, you'll end up with rich, creamy, al dente risotto every time. Here are 25 excellent vegetarian risottos to try out next, and our favourite creamy mushroom pasta recipes. Additional recipe notes by Alison Adams, Food Writer and Recipe Tester",
    "Tuna mornay\nThere’s a curious thing about comfort food. It’s nearly always simple, budget-friendly and made from items you may already have on hand. Whether it be a mac and cheese, bangers and mash or even a classic bread and butter pudding it’s the simple things that seem to hit the spot when needing a bit of nurturing that can only come from certain foods. This tuna mornay recipe is no exception.  Why is this our best tuna mornay recipe? Cheesy and creamy and on the table in just over half an hour, our tuna bake has the simple addition of celery which adds a nice crunch to the dish as well as a sweet and floral flavour. The other thing we love about this tuna mornay recipe, is that it’s made in individual servings, making it a fun dinner for the kids or a great meal prep and freeze-ahead meal for solo diners.   Love tuna? Here’s every canned tuna recipe you need to try. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester",
    "Thai green chicken curry\nAustralia has a natural affinity with Thai cuisine. It may be a climate thing, but all I know is our laid-back lifestyle befits the idea of shared plates, fresh ingredients and easy to prepare dishes.  Green chicken curry is at the essence of all this. While making your own curry paste is something everyone should do at least once, we now have the option of amazing supermarket versions, which means this authentic tasting dish can be on the table in just 30 minutes.  Why is this our best easy green curry recipe? This recipe has everything you want in a Thai curry, a good spice kick from the curry paste, saltiness from the fish sauce, the mandatory sweetness from brown sugar and a final squeeze of lime juice balances the dish with its citric tang. Green chicken curry is a dish that knows no season. As welcome on a hot summer’s day as it is in the depths of winter, the combination of creamy coconut milk, tender chicken and as much spice as you care for makes it a family favourite – or serve it up for a dinner party or Thai banquet (see more in our notes, below) And, try these Thai desserts to finish your meal on a delicious note. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester",
    "Vietnamese rice paper rolls\nAs the name suggests, these fresh rolls originated from Vietnam, but have become a staple around the world. Vietnamese rice paper rolls are healthy, brimming with fresh ingredients and not fried like spring rolls, and you can mix and match ingredients according to dietary needs, occasions and taste buds. Most rolls have a basic filling of vermicelli rice noodles, vegetables and herbs which can be paired with different proteins such as chicken, pork, prawn and beef, or if you prefer a vegetarian option tofu. For a dipping sauce, we serve our rolls with store-bought sweet chilli sauce but you could also make the traditional Nuoc cham (North Vietnamese dipping sauce) or a peanut dipping sauce.",
    "Crispy chicken schnitzel recipe\nClassic chicken schnitzel recipe A chicken schnitzel is a thing of beauty. With a golden, crisp crust enclosing tender, lean chicken, it is little wonder that it appears on menus around the world. Known as Katsu in Japan and cottaletta alla Milanese in Italy, here in Australia we call it a ‘schnitty’. For us Aussies, chicken schnitzel is one of our most ordered pub meals, especially when topped with an Italian tomato sauce and melted cheese - giving us chicken parmigiana! There’s no need to go out to the pub now that you have this perfect recipe on hand. Why is this our favourite chicken schnitzel recipe? What we love about this chicken schnitzel recipe is that it ups the ante a bit with the addition of lemon rind, parsley, and parmesan to the breadcrumbs. If you’re new to shallow frying, see below for all the tips and tricks to get the most gorgeous chicken schnitzel you’ve ever tasted on your plate, pronto. We also have a great airfryer chicken schnitzel recipe, and plenty of chicken dinner ideas for midweek culinary inspiration. Additional recipe notes by Alison Adams, Food Writer and Recipe Tester",
    "Honey-soy chicken recipe\nWant to know the secret for how to make honey soy chicken drumsticks in the oven? Well, with only three steps, six ingredients, some minimal effort and a lot of flavour you have one impressively flavourful winner of a chicken dinner ready to go.  Our beloved, prep-ahead honey-soy chicken drumsticks recipe sees an enticing marinade bring together the sweetness of honey, the saltiness of soy sauce, the gentle spice of ginger, a little kick of garlic to round things out, and a final sprinkling of sesame seeds. All you need to do is marinate your chicken drumsticks, pop them in the fridge (giving them an occasional turn) then bake them until golden. Pair your marinated chicken drumsticks with a speedy fried rice and you’ll soon be tossing away your take-away menus in favour of eating in. Some things are just better together, and we think honey and soy are two of these things. Need further proof? Try this tofu with sticky honey soy sauce and greens and this honey, soy and ginger glazed pork ribs.  Looking for more chicken drumstick recipes? Try these 13 easy chicken drumstick recipes that’ll have you arguing over the last bite.  Additional recipe notes by Sonya Gellert, Recipes Editor and Food Writer",
    "Corn and zucchini fritters\nThis is a great meal for children and a snack or light meal for adults. You could also serve these fritters with grilled meat such as chicken breast for a main meal.",
    "Beef shepherd's pie\nFor a classic family favourite, try this hearty shepherd's pie with beef mince, veg and topped with cheesy potato mash.",
    "Creamy chickpea and vegetable curry\nBoasting 7 serves of vegetables, this vegetarian curry is slow cooked perfection. Enjoy for dinner tonight and savour leftovers for lunch later in the week.",
    "Our favourite pea and ham soup recipe\nHear me out when I suggest pea and ham soup is the Ugg Boot of the soup world. It may not look the prettiest, but it provides warmth and comfort like nothing else.  The secret ingredient here? Time. Simmering for more than 2 hours allows the hock to soften until fork-tender and falling from the bone. It also allows the starches in the peas to be released into the soup, creating a creamy taste and texture. Why is this our favourite pea and ham soup? This pea and ham soup is so tasty it’s enough to make you yearn for winter at any time of the year. The holy trinity of onion, carrot and celery forms the aromatic base for this perfect pea and ham soup recipe. Tiny split peas slowly break down in water flavoured with the aromatics and an umami-packed ham hock. You can also pop this set-and-forget slow cooker pea and ham soup on and come home to a warming bowl of ready-made soup. Seeking more soup ideas? We’ve gathered together 67 warming winter soup recipes that aren’t pumpkin based. Key ingredients in pea and ham soup: Green split peas: nutritious, flavourful and budget-friendly, split peas are the underrated star of many great soups, but especially pea and ham soup. The texture cooked split peas create makes for a lovely, thick and hearty soup base. Carrots and celery: two classic soup ingredients, chopped carrots and celery bring an earthy flavour and added nutritional value to pea and ham soup. Onion and garlic: these little flavour savers add depth to soup, and complement the vegies in this classic comfort dish. Ham or bacon hocks: for a salty, umami-rich kick, ham or bacon hocks bring bold flavour and added texture to our pea and ham soup. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make pea and ham soup: full recipe below",
    "Coconut chicken curry recipe\nThis quick and easy coconut chicken curry is a simple way to liven up the week.",
    "Easy pork stir-fry recipe\nChina meets Vietnam in our sticky pork stir-fry. With pungent five spice and fish sauce teaming up with crunchy snow peas and pak choy. Bright and colourful, our pork and vegetable stir-fry ticks all the boxes; fast, healthy and best of all delicious.  The secret to the success of our quick and easy pork stir-fry is that it gets a quick sit in a marinade before being added to the wok. This adds both flavour and colour to the pork. Many of the major brands make a gluten free oyster sauce, so paired with rice noodles we have a coeliac-friendly dinner for all the family.  Why we love this Chinese pork stir-fry recipe First of all we love that despite its decadent flavour our pork stir-fry has a high health score of 8.3. We use pork medallions in our simple stir-fry as they are easy to slice and cook in a matter of minutes. You could also play around with whatever protein you have on hand, whether it be chicken, beef or even tofu (use a vegetarian oyster sauce and the dish is vegan)! Treat this recipe as a guide and use whatever veggies you have in the crisper drawer. What ingredients go into our pork and noodle stir-fry? Pork: We use loin medallions, which are exceptionally lean and tender - this equates to low fat and quick cooking.  Sugar: We use brown sugar but it can be swapped for caster if that’s what you have. Soy sauce: Make sure you use light soy sauce as the dark should only be used in small amounts to add colour to a dish. If you want this dish to be gluten free, use tamari instead.   Five spice: A combination of spices, only a judicious amount is needed for a complex tasty hit.  Fish sauce: Is a concentrated way of getting salt and umami into your dish. Ginger and garlic: It wouldn’t be a stir-fry without these aromatic heroes. Make sure they’re finely grated and crushed so they meld into the sauce. Vegetables: Our pork stir-fry uses a combination of capsicum, carrot, bok choy and snow peas, but these can be swapped for what’s in the crisper drawer or what the family prefers. Mushrooms, zucchini and bean sprouts all love a stir fry. Oyster sauce: Sweet and salty and earthy oysters sauce packs a load of flavour to meat fish and vegetable dishes, Cashews: Rich with healthy fats, we use dry roasted cashews that haven’t been salted. Green onion and red chilli: When thinly sliced, these add flavour, texture and make the dish look so moreish. For more stir-fry inspiration, peruse our wonderful weeknight stir-fry recipes. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester",
    "Prawn, mango & avocado salad\nThere’s nothing that symbolises an Australian summer more than seafood and mangoes. So, it’s only natural that they turn up together in this lightly spiced prawn salad. Our love of Thai flavours is  present with the tropical flavour of limes, coriander and chilli and the whole thing comes together in under 30 minutes.  This salad makes many appearances in my household over the summer, not only for dinner but also for simple entertaining, especially at Christmas where it can be piled onto a platter or served shaped into a wreath. You can also serve in martini glasses as individual serves for an entree Why we love this prawn and mango salad recipe Despite being absolutely delicious, our mango and prawn salad has a health score of 9.2, ticking a few dietary boxes. Not only is it low fat and gluten free it’s also suitable for people following a keto diet. In fact, our favourite summer salad recipe proves you can not only make friends with a salad, it can become your bestie for the restie.  What you need to make this simple prawn salad Prawns: We use cooked tiger prawns, but the best prawn to use is the freshest. Look for prawns that are brightly coloured, firm and shells intact. Avoid prawns with discolouration around the head. If you can get a sniff, make sure they smell like the ocean. Mangos: To tell if your mango is ripe, it should have a sweet fragrance and flesh that only yields slightly when pushed.  Limes: Adds a tropical zesty freshness to the salad. Grate on the fine side if a box grater or use a microplane.    Honey: Adds a sweetness to contrast with the acidic lime. Fresh coriander: If you’re one of the many people who aren’t fond of fresh coriander, you can swap it for finely shredded basil leaves. Chilli: We remove the seeds from our fresh chillies but keep them in if you prefer more heat. You could always serve it in a bowl to the side for people to sprinkle to taste. Avocado oil: We give the option of avocado or extra virgin olive oil. Both these oils are considered good fats and are an excellent source of monounsaturated fatty acids. Lettuce: Choose your favourite lettuce or you could use baby spinach or rocket.  Mango and seafood are perfect mates and turn up in many of taste.com.au’s recipes. Ripe sliced mango appears in this green curry featuring ling fillets and it can be finely diced and served with fresh oysters. A mango salsa adorns these jerked salmon tacos and one is quickly pureed and folded through mayonnaise to serve with fried coconut prawns.   Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make this prawn and mango salad: full recipe below",
    "Classic quiche Lorraine\nOur best-ever classic quiche Lorraine recipe.  I mean, let’s face it, we’re talking about pastry, bacon, cheese, eggs, cream… no wonder quiche Lorraine is one of the world’s most-loved quiches. Why do I love this classic quiche Lorraine recipe?  I love serving up this tart for brunch with a simple green salad dressed in a Dijon vinaigrette, but it’s also perfect for lunchboxes or you can make mini versions as part of an elegant high tea spread. This recipe is so simple thanks to store-bought pastry, but if you’re keen, we have a fabulous shortcrust pastry recipe in case you want to make pastry from scratch. And, if you’re “on a roll”, check out our collection of more than 200 quiche recipes. Additional recipe notes by Amira Georgy, Digital Food Director",
    "Aussie-style beef and salad tacos\nOur go-to tacos recipe These tacos are a fresh and flavourful twist on everyone’s favourite Mexican meal. It may stray from Mexican tradition, but it's become something of a tradition here in Australia. In this business, we often hear people referring to a particular component as being the ‘star of the dish’. With these crunch tacos though, the entire meal absolutely shines. Why do we love this easy taco recipe? The juicy, deliciously seasoned ground beef mince, crisp salad greens, and acidic tomato toppings creates the perfect week-night meal that will be gone in seconds. Whether you’re looking for a quick and easy dinner or a fun party food to share with friends and family, this flavourful and wonderfully textured dish is a great option for you. We have plenty of great taco filling ideas, from fish tacos to vegan tacos and prawn tacos, too. Taco Tuesday, anyone?",
    "Classic one-pot beef stew\nThis classic French-style beef stew is the ultimate one-pot dinner. With time the meat becomes fall-apart tender in a rich sauce, for a satisfyingly tasty beef stew with potatoes.",
    "Creamy chicken and risoni tray bake\nFor an easy one-pan dinner, try this creamy chicken, mushroom and risoni bake.",
    "Chicken enchiladas with tomato salsa\nA bought roast chicken and a jar of spicy sauce make light work of this enchilada recipe. With most ingredients probably in the pantry, All you need is 15 minutes prep time and dinner’s in the oven. The result? Cheesy, chicken-y tortillas, dotted with a Mexican-spiced sauce and topped with cooling sour cream.  Tortillas date back to both Mayan and Aztec times, where they were eaten plain or dipped in a hot tomato sauce. From this humble beginning the enchilada as we know it slowly emerged. As the dish moved up to Texas with migrant workers, it grew into a more elaborate meal, stuffed with meat and beans and baked.  Why we love this enchilada recipe Apart from being super simple and loaded with flavour, we also view this recipe as a template to play around with. Use corn tortillas for a gluten free version, or swap the chicken for bought or homemade pulled pork. How about frying up some sliced chorizo and scrambling some eggs to stuff the tortillas for breakfast for a crowd. You can swap the red salsa for a green enchilada sauce and you could also make the dish go further by serving with a side of boiled rice and refried beans. What you’ll need to make this enchilada recipe: Chicken: Call them roasted or barbecued (or a bachelors handbag) takeaway chicken from the supermarket is loaded with flavour. If you already have chicken fillets at home you could coat them in a Mexican spice mix and fry until cooked through. Set aside to cool and then shred.  Capsicum: We use red capsicum but you can also use green or a combination of both. Onion: Traditionally white onions are used in Mexican cooking, but they are milder than our version, so we use red instead. Cheese: We use tasty (which is just a made-up name for cheddar) cheese, but for a gooeyer twist use three cheese mix that includes mozzarella.  Tortillas: Wheat tortillas feature in this mild enchilada recipe, but you could also use the more traditional corn version. Make sure you buy the standard size, not jumbo ones. Salsa: This recipe uses a bottle of chunky salsa, if you prefer to could buy a smoother enchilada sauce Sour cream: Traditionally Mexican recipes use a tangy sauce called crema, which is more like creme fraiche and lime juice seasoned with salt, but light sour cream is a handy swap out.  The lines between what is an original Mexican dish and what is Tex-Mex are often blurred. Like enchiladas, nachos are traditionally Mexican, but are a much more pared down version. Other genuine Mexican dishes are tacos al pastor (see my twist using lamb here), chicken mole, refried beans and, of course guacamole. While tamales are a traditional Mexican dish, turning them into a pie is Tex-Mex as is chilli con carne, fajitas and that wonderful gooey dip queso. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make enchiladas: full recipe below",
    "Country chicken pie\nThis country chicken pie is proudly brought to you by Western Star.",
    "Fish tacos\nSoft fish tacos have to be one of my favourite Mexican midweek meals. They're flavourful, full of healthy ingredients and loved by my whole family. Why we love this fish taco recipe Not only are they quick and easy to prepare, but they’re family-friendly, too with everyone getting to pick their own toppings. For the best fish taco recipe, we choose firm white fish fillets as they hold their shape and have a mild flavour, and opt for corn tortillas as they are more authentic to Mexican cuisine. Key ingredients in this fish taco recipe Red cabbage: a brightly hued crunchy purple slaw makes a lovely addition to fish tacos. Lemon juice or lime juice: you can choose between lemon on lime, based on what you have. We just recommend you go fresh! And, we suggest serving the tacos with lime wedges, too. Corn: charred corn makes a flavourful (and colourful) addition to this healthy meal. Guacamole: we add lemon or lime juice, French shallots and coriander to mashed guacamole, for a tangy and creamy topping for our fish tacos. Coating for fish: we use a light coating of white plain flour, ground coriander and a little cayenne pepper (you can omit this if you want to) to prepare the fish. White fish fillets: choose the firmest fish fillets you can, to ensure they fold their shape. You can use any white fish you prefer. Flour tortillas: we use white flour tortillas, but feel free to use corn tortillas, if you wish. In fact, you can use any thin-style wraps as the vessel for your fish and salad. Sour cream: a cooling element to top your taco, you can use a thick, Greek-style yoghurt or creme fraiche if you prefer them to sour cream. Fresh jalapeno chilli: while jalapenos are optional here, they make a great spicy topping if you like a little heat. We have plenty of taco topping ideas to share, alongside our easy tuna tacos for a speedy taco Tuesday, or our classic Aussie-fied taco recipe. How to make fish tacos: full recipe below",
    "Grandma's curried sausages\nNothing is as comforting as a big plate of traditional curried sausages.",
    "Aussie meat pies\nThere’s no food more iconic in Australia than a meat pie. Sure, we have our Chiko Rolls and lamingtons, but there’s something about biting into a scaldingly hot meat pie that is a truly Aussie experience. Pies are the perfect convenience food. Not unlike a pastie that miners would take underground, hand-held meat pies have historically made an ideal lunch on the run as well as a one-handed snack balanced by a cold beer in the other.  While store bought pies tick the boxes of familiarity and comfort, there’s nothing like tucking into ones you’ve made yourself. This recipe for meat pies has it all, from the signature solid shortcrust base, thick beef and gravy filling and golden flaky puff pastry lids. The secret to our favourite meat pie recipe is the addition of that other Australian icon: Vegemite. Although subtle, it adds an umami kick that deepens and broadens the beefy flavour. Make a double batch and store these super tasty meat pies in the freezer, ready to be thrown into the oven or air fryer for a lunch, snack or dinner.   Next up, try your hand at home-made sausage rolls, pie maker meat pies, or how about mixing up your meat pie game with this nod to the great Adelaide invention, pie floaters? And, check out our collection of uniquely Australian recipes.  Additional recipe notes and recipes by Alison Adams - Food Writer and Recipe Tester.",
    "Juicy and delicious Italian beef meatball recipe\nSoft, juicy and packed with flavour, our Italian-style meatballs recipe is sure to become a family favourite. Serve meatballs with spaghetti, on a pizza or in a meatball sub. Some of the most famous dishes we think are from Italy were actually developed in America by Italian immigrants. While they may have a footing in a traditional dish, the lack of availability of traditional ingredients meant they were forced to experiment. And we’re still enjoying these spoils. What would life be like without chicken parma, garlic bread and, of course, spaghetti and meatballs? In Italy, pasta is served as a first course (primi) with meatballs known as polpette served after as a second course (secondi). The union of giant meatballs tossed through spaghetti is definitely an American thing.  Not just for spaghetti, serve these meatballs cooked in a rich tomato sauce on their own served with creamy mash, grilled polenta or in a crusty bread roll. Is it better to fry or bake meatballs? There are pros and cons to both methods. By frying your meatballs you get that glorious golden crust, but the tender meatballs can become misshapen no matter how gentle you are. The other option is to tray bake them in the oven so they hold their shape, but this does run the risk of stewing. This can be mitigated by placing the meatballs on a preheated tray or cooking them on a wire rack set over the top of a baking tray, which allows the air to circulate. Another option is to cook them in batches in an air fryer. Do this at 200C for 10 minutes, shaking the basket once or twice during cooking.  Nearly every country has its own version of meatballs, with the most popular (arguably) being Swedish. The Middle East has its koftas, Greece has its keftedes and in Spain meatballs are referred to as albondigas. Asian countries too have their own versions, including the Chinese classic lion’s head meatballs, Japanese tsukune and the Vietnamese have pork meatballs that are served with bun cha. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester.",
    "Madras beef curry\nAlthough based on the traditional spices of southern India, a Madras curry doesn’t actually exist in India, just as Mongolian lamb isn’t from China. Instead Madras (named after the city) was a name coined to describe a curry powder concocted by the British for English palates.  What emerged is a versatile spice blend to be used as the base for meat and vegetable curries or as a marinade. Medium-hot and with a slight tang from the lemon juice, Madras is normally quite a dry curry, so feel free to add more stock if you prefer a wetter one.  Why we love this madras recipe By blending the spices with garlic and ginger we make our own natural homemade spice paste that can then be used with chicken, pork, beef or lamb as well as vegetables. We like the fact that you control the heat, omitting the chilli powder or adding more depending on your personal or family’s preferences. What goes into a beef madras curry? Spices: The warmer notes of cumin powder go hand-in-hand with the sweeter-flavoured ground coriander. Along with turmeric they form the base of many curry blends.  chilli powder: If starting out on your chilli journey, look for Kashmiri chilli which gives a lovely red hue without too much heat,   Black pepper: although we often just think of it as a seasoning, Black pepper is an Indian spice that turns up in many curry mixes. It is believed that in order for the health benefits of turmeric to be released it needs to be paired with black pepper. Lemon juice: Adds the acidity that a madras is known for. Vinegar or tamarind can also be used.   Chuck steak: You could also use blade, topside or gravy beef. We cut the meat into 2.5cm cubes, which means it will cook in an hour and three-quarters. Cook for longer if you prefer the meat in larger pieces.  The good thing about madras curry paste is that it goes well with cheaper cuts of meat. Check out our recipe for lamb neck curry or use beef mince in this recipe for keema curry or how about serving up curried sausages for a retro dinner. You can also drop the meat completely and use madras curry paste in this budget-friendly curried lentil soup or creamy chickpea curry. This recipe was originally created by Kerrie Sun. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester How to make madras: full recipe below",
    "Chicken fried rice\nI get a bit sentimental when I see this recipe. It was one of the first recipes I wrote for Taste about (ahem) 20 years ago. I was asked to do a story on Thai food and the editor suggested I develop a recipe for Thai chicken fried rice. I’d never tried it, so in the spirit of research, I boldly went out, ordered it and have been cooking this recipe ever since.  While not a traditional Thai fried rice recipe, sweet chilli sauce would never be used as an ingredient in cooking. Instead, its role is as a condiment for spring rolls, gai yang and fish cakes, I like using it as a hack in place of a more traditional combination of fresh sliced chilli and a pinch of sugar.  Why we love this Thai-flavoured fried rice recipe Let’s face it, all fried rice is good. From a simple Chinese version with just ham, eggs and soy sauce served as an accompaniment to the grand versions like nasi goreng and kimchi fried rice that are served as meals in their own right. This fried rice falls into the latter category. Hearty and loved by all the family, it’s a quick mid week dinner - especially if you have some cooked rice in the freezer ready to be added from frozen.  Use the rice and sauce mixture as a guide and play around with other proteins. Use tofu or flavoured tempeh, pork fillets or throw in a handful of prawns. Some of our readers have suggested bulking out the recipe with vegetables as well, adding corn, capsicum, and sliced green beans.  What goes into this easy sweet chilli and chicken fried rice? Soy sauce: Make sure you use light soy sauce as the darker one is mainly used to add colour to a dish. Sweet chilli sauce: Made from sugar, pickled ginger, garlic and vinegar, sweet chilli sauce adds a slight hit of heat as well as stickiness to the fried rice recipe.  Oyster sauce: Originally from Southern China, umami packed oyster sauce is also used in Thai and Vietnamese cooking. Oil: We use peanut oil but swap it for any neutral flavoured oil. There is a lot of flavour in this dish so the oil doesn’t have to contribute in any way rather than as a cooking medium. Chicken: Thinly sliced chicken breast fillets cook in a matter of minutes and soak up the flavours from the sauce mixture well. You can use trimmed thigh fillets, just cut them into smaller pieces.  Onion: By cutting the onion into thin wedges, it acts as a vegetable as well as an aromatic. Garlic: Only 2 cloves are needed as there is some garlic in the sweet chilli sauce. Eggs: To me it isn't fried rice if it doesn’t have little specks of egg tossed through adding flavour plus an extra protein hit. Rice: Although you could use just long grain rice, jasmine has that lovely fragrance to it. Avoid a short grain as it has a higher starch content that we don’t need in this recipe. Save it for a risotto. Thai basil leaves: Identified by its purple stems and aniseed flavour, Thai basil is worth looking out for, If not regular basil will do. Fried shallots: These can be bought in the Asian produce aisle of the supermarket. As they contain oil, I store mine in the freezer for a longer life. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester",
    "Slow-cooker beef cheeks in red wine\nSlow-cooked beef with red wine and mushrooms. It’s a winning combo that most commonly turns up in that classic-for-a reason beef bourguignon. Using this as a basis our beef with wine recipe switches things up a bit by swapping the chuck steak for beef cheeks, adding loads of garlic and using not one - but three different types of mushroom. Slow cookers have a reputation of being one of the least cool appliances in the kitchen, often relegated to more run of the mill weeknight dishes. But this recipe proves you can use it to create a truly elegant meal. As one of our members’ husband proclaimed \"this is the best thing to come out of our slow cooker,\" \"this is better than what I've had in a restaurant,\" and \"make this again!\". If you’re new to the world of beef cheeks, this is a great introduction. Being a secondary cut of meat. they need to be slow cooked, so what better way than in a slow cooker. If serving to guests, prepare the recipe the day before, transfer to a bowl and allow to sit in the fridge overnight. This will allow the flavours to develop. As slow cookers aren’t great for re-heating, Reheat in a casserole dish in the oven. That way you get the just cooked smelI in the house but the beef cheeks will have even more flavour. Why we love this recipe Although it looks like a lot of ingredients, only a few of them need to be chopped, which means loads of flavour with very little prep. We also love the set and forget element, for let’s face it most dinner party recipes require a bit of added attention. That’s not to say this is an entertaining only recipe, beef cheeks can also be served as a simple midweek meal. As this recipe serves six, any leftovers can be shredded and tossed through fettuccine  What goes into this much-loved beef cheeks recipe? Beef cheeks: Literally beef from the muscle of a cow’s cheek, these belong to the group known as lesser cuts of beef, that also includes chuck steak, gravy beef, brisket. All of these can be used as a substitute if desired.  Mushrooms: We use a combination of oyster, button and shiitake. The great thing about oyster mushrooms is you don’t need to cut them, simply tear them in half. We pop our buttons in whole as well. Make sure you use fresh shiitakes as the dried version will overwhelm the dish. Oil: Don’t be stingy with the oil. You need the full two tablespoons to get a good colour on the beef before it goes in the bowl of the slow cooker.  Flour: Tossing the beef in plain flour before browning it off thickens the sauce for the beef cheeks. If you can’t have wheat you can thicken with some cornflour at the end of cooking.  Red wine: We say to use shiraz but pinot noir also works well. Garlic: We go in hard with the garlic in our favourite beef cheeks recipe. A full six cloves. When finely chopped they just melt into the sauce adding a subtle yet robust flavour,   Sugar: because we also use tomato paste we add brown sugar to round out the sometimes metallic taste it can add.   We have a few beef cheek recipes on taste.com.au. Another French-style recipe is Manu Feildel’s braised cheeks that he tops with a macaroni gratin and we have a classic daube that uses port and orange zest. Away from France we have a Spanish beef cheek recipe where they are cooked with Pedro Ximenez. Beef cheeks turn up in a lot of Mexican recipe, where they’re shredded and piled into tortillas or try this Italian version topped with salsa verde. The rich taste of beef cheeks can also stand up to spicy Sichuan peppercorns and star anise in our Mandarin and ginger braised beef. This was originally a member recipe, contributed by 'TA6574'. It has since been tested by food writer and recipe tester, Alison Adams. Recipe notes and introduction by Alison Adams. How to cook beef cheeks: full recipe below",
    "Our go-to easy chicken parmigiana recipe\nI don’t know about you, but if I see chicken parmigiana on a pub menu, I am compelled to order it. As if a golden crispy chicken schnitzel isn’t tempting enough, when drizzled with a rich and tangy Italian-style tomato sauce and topped with gooey, melty cheese, all bets are off. No need to step out to the local with this easy chicken parmigiana recipe. Why has this become our favourite chicken parmigiana recipe? There are a few reasons we love this ‘parmie’. To start, the addition of dried oregano in the crumb is a flavourful nod to its Italian ancestry. We then double the sauce action, drizzling it on the base of the baking dish as well as over the top of the fried schnitzels. We don’t skimp on the cheese either, using fresh, creamy buffalo mozzarella alongside sharp, salty parmesan. Perfect with a simple, crisp green salad. Or, take a leaf out of our American friends’ book and serve on top of cooked spaghetti. We’re big fans of getting creative with classics, and think this Mac ‘n’ cheese parmi tray bake makes a top-tier comfort dish. Or, try our Keto-friendly parmi for a low-carb alternative. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester",
    "Delicious ratatouille recipe (with how-to video!)\nA delicious ratatouille recipe to add to you repertoire Tangy tomatoes, spongy eggplant, sweet capsicum, soft, tangy onion… all these flavours combine to create this irresistible-yet-effortless dinner. Given its rich history, there have been many recipe variations, but this one is our favourite. The name actually gives a hint as to what the meal consists of – it combines the French words “rata”, which is a type of stew with chunky, chopped pieces in it, and “touiller”, meaning ‘to stir’. Why do we love this ratatouille recipe? The flavours of the vegetables and fresh, fragrant herbs compliment each other so brilliantly. What’s more, the ease of our recipe makes it one you’ll be returning to weekly! You can serve ratatouille on its own, over pasta, but our favourite is on a crusty piece of sourdough bread to soak up that aromatic tomato sauce. Additional recipe notes by Alison Adams, Recipe Tester and Food Writer",
    "Vegetable frittata\nTasty hot or cold, this frittata is also easily transportable, so it’s perfect for popping into lunch boxes. See notes section for FODMAP diet tip.",
    "Pumpkin, spinach and lentil lasagne\nThis tasty recipe for healthy vegetable lasagne has stunning layers of spinach, ricotta, lentils and pumpkin. It's the perfect dish for sharing with friends and family.",
    "Chicken pasta bake\nLike peaches and cream and a coach and his team (you know the rest…) chicken and bacon are true companions. Appearing in centuries-old dishes like coq au vin and modern classics like our famed keto cauliflower bake, this power couple can do no wrong.  With our chicken and bacon pasta bake, we’ve added tender roasted pumpkin and tossed it all in a thick creamy sauce with just cooked pasta. An Instagram-worthy amount of cheese is added and then after a stint in the oven you have a truly comforting and satisfying family meal.  What do you serve with pasta bake? Serve our favourite pasta bake with a fresh green salad or even garlic bread to up the comfort factor. This ultimate chicken pasta bake serves six, which means any leftovers can be popped into the freezer or eaten for lunch the next day. Winner, winner, leftover chicken dinner. For more easy chicken recipes ideal for weeknights, check out our collection of better-for-you, simple chicken dinners. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester",
    "Healthier chicken chow mein\nTry this healthy version of the Chinese takeaway classic. In just 25 minutes you can feed the whole family a tasty healthy chicken dish that won't disappoint!",
    "Porcupine meatballs\nHere's a retro favourite that is sure to be a hit with the kids. Made in one pot, it's sure to be a hit with the adults too.",
    "Sweet and sour pork\nThis old-time favourite is still cooked nightly in a Chinese restaurant near you!",
    "Singapore noodles\nThis old-style noodle dish is as popular and delicious as ever!",
    "Zucchini and haloumi fritters",
    "Meatballs in rich tomato sauce\nThis recipe for spaghetti with meatballs is kind to the budget so you can afford to make lots and freeze some for later.",
    "Green chicken curry\nThis amazing green chicken curry is guaranteed to have your family coming back for seconds.",
    "Creamy chicken bake\nThis hearty chicken bake is designed to satisfy even the hungriest of appetites.",
    "Classic, crispy beer-battered fish and chips\nCall off the take-away: make this beer-battered fish and chips We all know what we’re looking for in a batter. It must be thin, crisp and golden – that’s a given, yet it also must be thick enough to protect the food inside from the ferocious heat of the oil.  All batters are made from flour and a liquid, yet arguably the crispest most glorious batter, is created by the addition of a carbonated liquid like soda water – or, in this case, beer. And, once you’ve tasted it, you’ll know exactly why beer batter recipes are so popular.  Why do you add beer to batter? Gently whisking beer into batter means tiny bubbles of air become trapped to create a thick foam. This foam becomes partially solid when added to oil yet still retains its airiness. Not only does the beer help create the crisp texture of the batter, it also adds flavour and the sugars caramelise the batter slightly – making it super golden. With our beer battered fish recipe, we also provide a recipe for simple oven-baked wedges, which happily roast away as you prepare the fish.  This versatile batter recipe can also be used to coat vegetables like wedges of potato, batons of zucchini and onion rings – as well as other seafood like oysters, prawns and squid. If you’re craving more beer-battered dishes, try our beer-battered barra and potato scallops recipe next. Additional recipe notes by Alison Adams - Food Writer and Recipe Tester",
    "Our best easy cottage pie recipe\nWe can’t think of anything better than a hearty and flavourful meat pie when we crave a comforting meal. That’s why this classic cottage pie is a favourite in our home. The flavourful ground beef mince base  topped with velvety mashed potatoes, and a sprinkling of cheese is what cottage pie recipe dreams are made of. What's in our best easy cottage pie recipe? Thanks to only 20"
]